<?PHP
	$aryStr1[1] = "スコアのバランスからハラスメントを起こすリスクは現時点で高くないと思われます。しかしながら、部下を持つ管\n理職であれば、ハラスメントを起こしてしまう可能性に一定の注意が必要です。今後、仕事内容、職場環境、人間関\n係等が変化することがあれば、あなた自身が重きをおく行動も変化するでしょう。その際、これまで注意して行動で\nきていたことに気が回らなくなってしまい、配慮のない傲慢な言動や無責任な態度をとってしまうことがないように\n注意しましょう。";


	$aryStr1[2] = "ハラスメントをつい起こしてしまう可能性に注意が必要です。特にスコアの高い項目についてはあなた自身の言動を\n振り返るようにしましょう。管理職としてストレスを受けやすい立場であると思われますが、感情のままの言動や周\n囲への配慮のない振る舞いがあれば、ハラスメントと受け取られる可能性があります。ハラスメントを起こす人は、\n自身がハラスメントを起こしていることに気づいていないケースがほとんどです。相手の立場・視点に立った周囲へ\nの働きかけを心がけていきましょう。";

	$aryStr1[3] = "ハラスメントを起こすリスクがあります。この水域にある人は仕事面で「気負いなく、自信を持って、状況に応じて\n柔軟に対処できる」力があり、周囲 から頼りにされるケースも多いと思われます。但し、対人共感リスクのスコアが\n高く出ている場合は特に十分な注意が必要です。ともすれば仕事ができる分、配慮のない傲慢な言動や、無責任な仕\n事の無茶ぶりにより、部下を疲弊させてしまう可能性もあります。ハラスメントを起こす人は、自身がハラスメント\nを起こしていることに気づいていないケースがほとんどです。あなた自身の言動を十分に振り返り、相手の立場・視\n点に立った周囲への働きか けを心がけていきましょう。
";
	
	$aryRyui[1][1] = "相対的に対人共感リスクが高いものの、ハラスメントリ\nスクは高くありません。但し、成果を求められる管理職\nとしての立場、職場環境、人間関係等が変わるとストレ\nス状態も変化し、その変化が刺激となってあなたの行動\nパターンも変わる可能性もあります。あなた自身の行動\nの振り返りは常に行いましょう。";
	$aryRyui[1][2] = "相対的に対人共感リスクが高い状態です。いくら論理的\nかつ明快に説明しても、相手の立場や視点に立った説明\nや配慮がなされなければ、感情的に相手からNoを突きつ\nけられる可能性もあります。相手を慮る姿勢に欠けると\n、時として傍若無人な態度に見受けられる可能性もあり\n注意が必要です。";
	$aryRyui[1][3] = "対人共感リスクについて、ハラスメントを起こす方と同\n様の傾向が見受けられ、十分な注意が必要です。相手の\n状況や立場を慮らず、もしくは分かっている気になって\n相手・周囲に働きかけをすることで嫌悪感を持たせたり\n、例え論理的には正しい主張でも、「この人にはついて\nいけない」と感情的に思わせてしまう可能性があります。";


	$aryRyui[2][1] = "スコアのバランスから、相対的に状況察知リスクが高い\nものの、ハラスメントリスクは高くありません。但し、\n成果を求められる管理職としての立場、職場環境、人間\n関係等が変わるとストレス状態も変化し、その変化が刺\n激となってあなたの行動パターンも変わる可能性もあり\nます。あなた自身の行動の振り返りは常に行いましょう。";
	$aryRyui[2][2] = "相対的に状況察知リスクが高い状態です。相手の表情や\n場の雰囲気、言葉のニュアンスなど外に表れる信号にア\nンテナを張るをことで機転を効かせたり、スピーディな\n状況対応が可能になります。アンテナを張ろうとする意\n識が相対的に低いため、所謂、空気の読めない行動や、\n良かれと思ってとった行動が空回りしてしまう可能性が\nあります。";
	$aryRyui[2][3] = "状況察知リスクについて、ハラスメントを起こす方と同\n様の傾向が見受けられ、十分な注意が必要です。表情や\n場の雰囲気、言葉のニュアンス等、相手からのシグナル\nにアンテナを張る意識が低いため、あなたの言動や働き\nかけが独りよがりとなる可能性があります。";


	$aryRyui[3][1] = "相対的に業務分担リスクが高いものの、ハラスメントリ\nスクは高くありません。但し、成果を求められる管理職\nとしての立場、職場環境、人間関係等が変わるとストレ\nス状態も変化し、その変化が刺激となってあなたの行動\nパターンも変わる可能性があります。自分を客観視しよ\nうとする意識が低い傾向があり、注意は必要です。また\n、自分のやり方に固執したり、抱え込んでしまう傾向が\nあるかもしれません。";

	$aryRyui[3][2] = "相対的に業務分担リスクが高い状態です。自分の役割や\n生かすべき能力について意識をしていると思われ、自分\nがやるべき仕事でないと考えるものについては部下に仕\n事を振ることができます。効率的に仕事を進めていくた\nめに、仕事を抱え込むのではなくチームで業務分担する\nことは管理職として当然必要です。但し、もし部下の状\n況をわきまえずに仕事を振ってしまうことがあれば、か\nえって非効率や不和を生み出す可能性もあり注意が必要\nです。";

	$aryRyui[3][3] = "業務分担リスクについて、ハラスメントを起こす方と同\n様の傾向が見受けられ、十分な注意が必要です。部下に\n振ることができる仕事は積極的に任せているように見受\nけられます。効率的に仕事を進めていく上で業務分担は\n重要です。但し、無責任に仕事を振っている印象を与え\nないように、相手の立場や状況をわきまえて適切に仕事\nを振ることを必ず心がけましょう。";


	$aryRyui[4][1] = "相対的に感情コントロールリスクが高いものの、ハラス\nメントリスクは高くありません。但し、成果を求められ\nる管理職としての立場、職場環境、人間関係等が変わる\nとストレス状態も変化し、その変化が刺激となってあな\nたの行動パターンも変わる可能性もあります。あなた自\n身の行動の振り返りは常に行いましょう。";
	$aryRyui[4][2] = "相対的に感情コントロールリスクが高い状態です。良い\n状態であれば気負いなく自然体で仕事に向き合っている\nと思われます。但し、自然体で感情をコントロールしな\nい言動があれば周囲に動揺を与える可能性もあるため注\n意も必要です。感情をコントロールしようとする意識が\n相対的に低いため、感情的になったり、我慢すべき言動\nに歯止めが効かない状態にならないように注意が必要で\nす。";
	$aryRyui[4][3] = "感情コントロールリスクについて、ハラスメントを起こ\nす方と同様の傾向が見受けられ、十分な注意が必要です\n。気負いなく自然体で仕事に取り組むことはパフォーマ\nンスの向上につながります。反面、その場の感情のまま\nの言動をとってしまう可能性があります。あなた自身の\n管理職としての影響力を改めて考えてみましょう。";

	$aryRyui[5][1] = "相対的にポジティブ思考リスクが高いものの、ハラスメ\nントリスクは高くありません。但し、成果を求められる\n管理職としての立場、職場環境、人間関係等が変わると\nストレス状態も変化し、その変化が刺激となってあなた\nの行動パターンも変わる可能性もあります。あなた自身\nの行動の振り返りは常に行いましょう。";
	$aryRyui[5][2] = "相対的にポジティブ思考リスクが高い状態です。状況の\n変化に柔軟に対応したり、物事の明るい面を捉えようと\nする姿勢は仕事の推進力として必要です。但し、過剰な\n場合は状況や相手の感情を楽観的に読み誤る場合もあり\n、注意が必要です。";
	$aryRyui[5][3] = "ポジティブ思考リスクについて、ハラスメントを起こす\n方と同様の傾向が見受けられ、十分な注意が必要です。\n「これくらいは大丈夫だろう」と、状況や相手の感情を\n楽観的に捉え過ぎ、周囲の反感を買ったり困惑させたり\nする可能性があります。";


	$aryRyui[6][1] = "相対的に自己肯定リスクが高いものの、ハラスメントリ\nスクは高くありません。但し、成果を求められる管理職\nとしての立場、職場環境、人間関係等が変わるとストレ\nス状態も変化し、その変化が刺激となってあなたの行動\nパターンも変わる可能性もあります。あなた自身の行動\nの振り返りは常に行いましょう。";
	$aryRyui[6][2] = "相対的に自己肯定リスクが高い状態です。自分に自信を\n持つことは仕事を進めていく上で推進力となります。反\n面、過去の成功体験にこだわり過ぎたり、自らの仕事の\n進め方に自信を持ち過ぎてしまうことで、周囲に対する\n注意やアンテナが散漫になり失言やミスをしたり、傲慢\nに振る舞ってしまう可能性もあります。注意をしていき\nましょう。";
	$aryRyui[6][3] = "自己肯定リスクについて、ハラスメントを起こす方と同\n様の傾向が見受けられ、十分な注意が必要です。過去の\n成功体験や、できるという自信は仕事を進める上で重要\nな推進力になります。但し、自信過剰になると周囲に対\nする配慮や注意が散漫になり、失言や傲慢な言動をとっ\nてしまう可能性があります。";



	$aryJyog[1][1] = "相手の視点・立場に思いをはせて、行動をとる姿勢は管\n理職として仕事を推進していく上で不可欠です。今後も\nこの姿勢を大事にしていきましょう。";
	$aryJyog[1][2] = "相手の立場や状況を理解しようとしつつ、コミュニケー\nションをとることは対人関係構築の基礎です。傾聴など\nのコミュニケーショントレーニングだけでなく、チーム\nメンバーの個別具体的な人物に思いをはせて、どのよう\nな働きかけがそれぞれに効果的なのか振り返りの機会を\n作ると良いでしょう。";
	$aryJyog[1][3] = "相手の立場や状況を理解しようとしつつ、コミュニケー\nションをとることは対人関係構築の基礎です。傾聴など\nのコミュニケーショントレーニングだけでなく、チーム\nメンバーの個別具体的な人物に思いをはせて、どのよう\nな働きかけがそれぞれに効果的なのか振り返りの機会を\n作ると良いでしょう。";

	$aryJyog[2][1] = "相手の表情や仕草、場の雰囲気、言葉のニュアンスを意\n識して行動することで、管理職としてのリーダーシップ\nが空回りすることなく有効に機能します。今後も状況を\n察知しようとする姿勢を大事にしていきましょう。";
	$aryJyog[2][2] = "しっかりと相手の表情を見て会話をしたり、会議中の場\nの雰囲気にアンテナを張る意識を持ちましょう。表情や\n雰囲気を察知する能力は使わなければ低下します。場の\n雰囲気について第３者の意見を聞いてみたり、相手の表\\n情にしっかりと意識を向け、どのような感情を持ってい\nるのか推し量り、察知力を高めていきましょう。会議・\n交渉の後、同席者に「こんな雰囲気だったよね」と確認\nし、フィードバックをもらうことも効果的です。";
	$aryJyog[2][3] = "しっかりと相手の表情を見て会話をしたり、会議中の場\nの雰囲気にアンテナを張る意識を持ちましょう。表情や\n雰囲気を察知する能力は使わなければ低下します。場の\n雰囲気について第３者の意見を聞いてみたり、相手の表\\n情にしっかりと意識を向け、どのような感情を持ってい\nるのか推し量り、察知力を高めていきましょう。会議・\n交渉の後、同席者に「こんな雰囲気だったよね」と確認\nし、フィードバックをもらうことも効果的です。";

	$aryJyog[3][1] = "業務分担は効率的に仕事を進めるためにも重要です。部\n下に一定の責任を与えることは、部下の成長を促す契機\nにもなります。ストレスに起因するハラスメント行動を\n生まないためにも、効率的に仕事を進めていく方法やチ\nーム内での業務分担を検討してみると良いでしょう。ま\nた積極的に他者からフィードバックをもらうなど、自己\n客観視してみるのも良いでしょう。";

	$aryJyog[3][2] = "仕事を振りすぎ、任せきりで部下が忙殺されていること\nはないか注意をしてみましょう。部下に一定の責任を与\nえることで成長を促すことは大切ですが、部下の能力に\nよっては仕事を溜め込んでしまい、問題発見が遅れたり\n、進捗が遅れたりする可能性もあります。管理職として\n仕事を振る際のコミュニケーションの取り方、タスクの\n棚卸しや進捗管理の方法について振り返り、学ぶ機会を\n作ってみるのも良いでしょう。";

	$aryJyog[3][3] = "仕事を振りすぎ、任せきりで部下が忙殺されていること\nはないか注意をしてみましょう。部下に一定の責任を与\nえることで成長を促すことは大切ですが、部下の能力に\nよっては仕事を溜め込んでしまい、問題発見が遅れたり\n、進捗が遅れたりする可能性もあります。管理職として\n仕事を振る際のコミュニケーションの取り方、タスクの\n棚卸しや進捗管理の方法について振り返り、謙虚に学ぶ\n機会を作ってみると良いでしょう。";


	$aryJyog[4][1] = "感情のコントロールが必要とされるストレスフルな環境\nにいる可能性があります。その場合は他者のストレス発\n散の方法を参考にしたり、周囲に相談するなどして適度\nにストレスを発散させていきましょう。";
	$aryJyog[4][2] = "「どんな状況で、どう評価(思考)し、どんな感情を持ち、\nどのような行動に至ったのか。その行動の結果はどうだ\nったのか。」について日記などをつけて振り返ってみま\nしょう。あなた自身の感情や思考のクセを理解できます\n。思考や感情のクセが変われば、行動と結果が変わりま\nす。管理職としての周囲への影響を考え、どのように自\n分の思考や感情のクセを変えると効果的にリーダーシッ\nプを発揮できるのか考えてみるのも良いでしょう。";
	$aryJyog[4][3] = "「どんな状況で、どう評価(思考)し、どんな感情を持ち、\nどのような行動に至ったのか。その行動の結果はどうだ\nったのか。」について日記などをつけて振り返ってみま\nしょう。あなた自身の感情や思考のクセを理解できます\n。思考や感情のクセが変われば、行動と結果が変わりま\nす。管理職としての周囲への影響を考え、どのように自\n分の思考や感情のクセを変えると効果的にリーダーシッ\nプを発揮できるのか謙虚に考えてみるのも良いでしょう。";


	$aryJyog[5][1] = "どちらかと言うと物事を慎重にクリティカル(批判的)に\n見る傾向があります。部下・同僚とのコミュニケーショ\nンにおいて、重箱の隅をつつくような指摘で、ともすれ\nば嫌がらせと捉えられることがないように注意をしまし\nょう。良い面を見出そうとする姿勢は物事を進めていく\n上で大事な推進力になります。物事のポジティブな面と\nネガティブな面の両面をバランスよく意識していきまし\nょう。";
	$aryJyog[5][2] = "対人関係や状況をポジティブに捉えすぎてしまい、チー\nムが疲弊したり、部下がついていけないと感じてしまう\n可能性に注意しましょう。チームメンバーの表情・雰囲\n気や、部下をはじめとする周囲の人に１日どのような働\nきかけを行ったのかを振り返りつつ、「これくらい言っ\nても(やっても)大丈夫」という勝手な前提を元に働きかけ\nをしていなかったか振り返ってみましょう。";
	$aryJyog[5][3] = "対人関係や状況をポジティブに捉えすぎてしまい、チー\nムが疲弊したり、部下がついていけないと感じてしまう\n可能性に注意しましょう。チームメンバーの表情・雰囲\n気や、部下をはじめとする周囲の人に１日どのような働\nきかけを行ったのかを振り返りつつ、「これくらい言っ\nても(やっても)大丈夫」という勝手な前提を元に働きかけ\nをしていなかったか振り返ってみましょう。";


	$aryJyog[6][1] = "相対的に過去の経験について自信を持つことができてい\nないように見受けられます。自信に裏付けられた行動は\n成果を生み出す源泉となり、物事を進める推進力となり\nます目標やタスクの大小は問わず、日々実現できたこと\nを日記などで振り返るなどして自信を深めてください。\n可能性として妬みや卑屈な態度などで周囲にマイナスの\n影響を与えることがないように注意をしてください。";
	$aryJyog[6][2] = "自信過剰になってしまうと傲慢な態度に見えてしまった\nり、人が意見しづらい状況を生み出してしまう可能性が\nあります。この適性検査で客観的かつ冷静に自分自身を\n振り返る他、他者がどのように自分を見ているのか直接\n意見を聞いてみたり、アンケートをとったりするのも良\nいでしょう。";
	$aryJyog[6][3] = "自信過剰になってしまうと傲慢な態度に見えてしまった\nり、人が意見しづらい状況を生み出してしまう可能性が\nあります。そのような言動があなた自身にないか謙虚に\n振り返ってみましょう。この適性検査で客観的かつ冷静\nに自分を振り返る他、他者がどのように自分を見ている\nのか直接意見を聞いてみたり、アンケートをとったりす\nるのも良いでしょう。";


	$aryLang[1][1] = "■「なぜできないのか分からない」と呆れ顔を見せる。
■フォローするつもりはなく、「いいからやってみろ」
　と仕事を振る。
■「なんでやらないの？」「なんで行動しないの？」と
　詰める。
■部下の欠点を周囲によくしゃべる。
■「相手や周囲のことを気にすると、きりがない」と考
　える。";

	$aryLang[1][2] = "■「なぜできないのか分からない」と呆れ顔を見せる。
■フォローするつもりはなく、「いいからやってみろ」
　と仕事を振る。
■「なんでやらないの？」「なんで行動しないの？」と
　詰める。
■部下の欠点を周囲によくしゃべる。
■「相手や周囲のことを気にすると、きりがない」と考
　える。";

	$aryLang[1][3] = "■「なぜできないのか分からない」と呆れ顔を見せる。
■フォローするつもりはなく、「いいからやってみろ」
　と仕事を振る。
■「なんでやらないの？」「なんで行動しないの？」と
　詰める。
■部下の欠点を周囲によくしゃべる。
■「相手や周囲のことを気にすると、きりがない」と考
　える。";


	$aryLang[2][1] = "■「とにかくやってみろ」と仕事を振る。
■言いたいことをつい主張してしまう。
■自分の言動で場が盛り上げらず、静かになってしまう。
■「あいつが考えていることが分からない」とよく思う。
■「どんな状況でも対応できる」と自信を持っている。";

	$aryLang[2][2] = "■「とにかくやってみろ」と仕事を振る。
■言いたいことをつい主張してしまう。
■自分の言動で場が盛り上げらず、静かになってしまう。
■「あいつが考えていることが分からない」とよく思う。
■「どんな状況でも対応できる」と自信を持っている。";

	$aryLang[2][3] = "■「とにかくやってみろ」と仕事を振る。
■言いたいことをつい主張してしまう。
■自分の言動で場が盛り上げらず、静かになってしまう。
■「あいつが考えていることが分からない」とよく思う。
■「どんな状況でも対応できる」と自信を持っている。";

	$aryLang[3][1] = "■自分の意見に固執する(他人に意見に耳を貸さない)。
■自分の間違いを認めたがらない。
■自分は棚にあげ、他人を責める。
■「これは私にしかできない」「私がやるしかない」。
■仕事を抱え込み、ストレスを感じがち。";
	$aryLang[3][2] = "■部下の得意・不得意、状況に配慮せず、どんどん指示
　を出す。
■部下に振った仕事を忘れる。もしくはフォローしない。
■「君に任せただろう」と責任をとらない。
■「これは私の仕事じゃない」と部下に仕事を振る。
■「こんなことまで私にやらせるな」と怒る。";
	$aryLang[3][3] = "■部下の得意・不得意、状況に配慮せず、どんどん指示
　を出す。
■部下に振った仕事を忘れる。もしくはフォローしない。
■「君に任せただろう」と責任をとらない。
■「これは私の仕事じゃない」と部下に仕事を振る。
■「こんなことまで私にやらせるな」と怒る。";

	$aryLang[4][1] = "■会話中に言葉遮って、主張する。
■会話中に嫌みを言ったり、ため息をつく。
■衝動的に発言したり、感情的に反応する。
■自分の欠点や誤りを指摘されると不機嫌になる。
■イライラした表情を見せる。";
	$aryLang[4][2] = "■会話中に言葉遮って、主張する。
■会話中に嫌みを言ったり、ため息をつく。
■衝動的に発言したり、感情的に反応する。
■自分の欠点や誤りを指摘されると不機嫌になる。
■イライラした表情を見せる。";
	$aryLang[4][3] = "■会話中に言葉遮って、主張する。
■会話中に嫌みを言ったり、ため息をつく。
■衝動的に発言したり、感情的に反応する。
■自分の欠点や誤りを指摘されると不機嫌になる。
■イライラした表情を見せる。";

	$aryLang[5][1] = "■人の発言をすぐ否定する。
■「違う」「そうじゃなくてね」と詰める。
■重箱の隅をつつく。細かいところばかり気になる。
■相手の短所、欠点ばかりに目がいってしまう。
■ネガティブな感想や発言に同調を求めてしまう。";
	$aryLang[5][2] = "■「すぐできるだろう」と仕事を振る。
■「これくらい、大丈夫だろう」と考えがち。
■「あいつはこれくらい大丈夫」と思いがち。
■根拠なく「なんとなかなるだろう」「できるはず」と
　思う。
■親しげにボディタッチする。";
	$aryLang[5][3] = "■「すぐできるだろう」と仕事を振る。
■「これくらい、大丈夫だろう」と考えがち。
■「あいつはこれくらい大丈夫」と思いがち。
■根拠なく「なんとなかなるだろう」「できるはず」と
　思う。
■親しげにボディタッチする。";

	$aryLang[6][1] = "■「なぜこんなことができないの？」と詰める。
■「こんなの簡単だろう？」と仕事を振る。
■「こんなこと、私にいちいち言わせるな」と怒る。
■「私は○○さんとは違うんだ」と誇る。
■「言う通りにすればいい」と意見を受け付けない。";
	$aryLang[6][2] = "■「なぜこんなことができないの？」と詰める。
■「こんなの簡単だろう？」と仕事を振る。
■「こんなこと、私にいちいち言わせるな」と怒る。
■「私は○○さんとは違うんだ」と誇る。
■「言う通りにすればいい」と意見を受け付けない。";
	$aryLang[6][3] = "■「なぜこんなことができないの？」と詰める。
■「こんなの簡単だろう？」と仕事を振る。
■「こんなこと、私にいちいち言わせるな」と怒る。
■「私は○○さんとは違うんだ」と誇る。
■「言う通りにすればいい」と意見を受け付けない。";
	//----------------------------------------------
	//棒グラフ画像作成1
	//----------------------------------------------
	$img1 = "./images/pdf/24_1img".$id.".jpg";
	if($testdata[ 'type' ][ 'personal' ] > 0){
		$dev7 = $testdata[ 'type' ][ 'personal' ];
	}else{
		//対人共感リスク：100 - 対人共感力
		$dev7 = getLimit(round(100-$testdata[ 'type' ][ 'dev7' ],1));
	}
	$d = $dev7;
	if($dev7 == 20 ) $d = 21;
	if($dev7 == 80 ) $d = 79.5;
	$wid = (378*($d-20))/60; //45
	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img1);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成2
	//----------------------------------------------
	$img2 = "./images/pdf/24_2img".$id.".jpg";
	if($testdata[ 'type' ][ 'state' ] > 0){
		$dev8 = $testdata[ 'type' ][ 'state' ];
	}else{
		$dev8 = getLimit(round(100-$testdata[ 'type' ][ 'dev8' ],1));
	}
	$d = $dev8;
	if($dev8 == 20 ) $d = 21;
	if($dev8 == 80 ) $d = 79.5;
	$wid = (378*($d-20))/60; 

	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid-2, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img2);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成3業務分担リスク：客観的自己評価力
	//----------------------------------------------
	$img3 = "./images/pdf/24_3img".$id.".jpg";
	if($testdata[ 'type' ][ 'job' ] > 0){
		$dev2 = $testdata[ 'type' ][ 'job' ];
	}else{
		$dev2 = getLimit(round($testdata[ 'type' ][ 'dev2' ],1));
	}
	$d = $dev2;
	if($dev2 == 20 ) $d = 21;
	if($dev2 == 80 ) $d = 79.5;

	$wid = (378*($d-20))/60; 

	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid-2, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img3);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成4
	//----------------------------------------------
	$img4 = "./images/pdf/24_4img".$id.".jpg";
	if($testdata[ 'type' ][ 'image' ] > 0){
		$dev4 = $testdata[ 'type' ][ 'image' ];
	}else{
		$dev4 = getLimit(round(100-$testdata[ 'type' ][ 'dev4' ],1));
	}
	$d = $dev4;
	if($dev4 == 20 ) $d = 21;
	if($dev4 == 80 ) $d = 79.5;

	$wid = (378*($d-20))/60; 
	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid-2, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img4);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成5
	//----------------------------------------------
	$img5 = "./images/pdf/24_5img".$id.".jpg";
	if($testdata[ 'type' ][ 'positive' ] > 0){
		$dev6 = $testdata[ 'type' ][ 'positive' ];
	}else{
		$dev6 = getLimit(round($testdata[ 'type' ][ 'dev6' ],1));
	}
	$d = $dev6;
	if($dev6 == 20 ) $d = 21;
	if($dev6 == 80 ) $d = 79.5;

	$wid = (378*($d-20))/60;
	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid-2, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img5);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成6
	//----------------------------------------------
	$img6 = "./images/pdf/24_6img".$id.".jpg";
	if($testdata[ 'type' ][ 'self' ] > 0){
		$dev3 = $testdata[ 'type' ][ 'self' ];
	}else{
		$dev3 = getLimit(round($testdata[ 'type' ][ 'dev3' ],1));
	}
	$d = $dev3;
	if($dev3 == 20 ) $d = 21;
	if($dev3 == 80 ) $d = 79.5;

	$wid = (378*($d-20))/60;
	$im        = imagecreatetruecolor($wid, 20);
	$img_color = imagecolorallocate($im, 1, 153, 0);
	$gray      = imagecolorallocate($im, 169, 169, 169);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, $wid-2, 18, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img6);
	imagedestroy($im);

	//----------------------------------------------
	//棒グラフ画像作成2
	//----------------------------------------------
	
	$i = 0.5;
	$h = 134;
	do{
		$str = sprintf("%s",$i);
		$str2 = sprintf("%s",$h);
		$arrays[$str] = (float)$str2;
		$i = $i+0.5;
		if($type[72]){
			$h = $h-4.25;
		}else{
			$h = $h-4;
		}
	}while($i<=10);
	$img7 = "./images/pdf/24_7img".$id.".jpg";
	$tate7 = (float)getPoint($testdata);
	$ht = 30*$tate7;
	if($tate7 == "10"){
		$im        = imagecreatetruecolor(20, $ht+5);
	}else{
		$im        = imagecreatetruecolor(20, $ht+1);
	}
	$img_color = imagecolorallocate($im, 255, 0, 0);
	$gray      = imagecolorallocate($im, 255, 0, 0);

	imagefill($im , 0 , 0 , $gray);
	imagefilledrectangle($im, 1, 1, 10, $ht, $img_color);

	$text_color = imagecolorallocate($im, 255, 0, 0);
	imagestring($im, 1, 5, 5,  "", $text_color);
	imagejpeg($im, $img7);
	imagedestroy($im);

	//一番留意すべき項目の傾向値配列の作成
	$devArray1 = array(
					array(
						"id"=>1
						,"val"=>$dev7
						,"name"=>"対人共感リスク"
					),
					array(
						"id"=>2
						,"val"=>$dev8
						,"name"=>"状況察知リスク"
					),
					array(
						"id"=>3
						,"val"=>$dev2
						,"name"=>"業務分担リスク"
					),
					array(
						"id"=>4
						,"val"=>$dev4
						,"name"=>"感情コントロールリスク"
					),
					array(
						"id"=>5
						,"val"=>$dev6
						,"name"=>"ポジティブ思考リスク"
					),
					array(
						"id"=>6
						,"val"=>$dev3
						,"name"=>"自己肯定リスク"
					),
			);
	foreach($devArray1 as $key=>$value){
		$key_id[$key] = $value['id'];
		$key_val[$key] = $value['val'];
	}
	array_multisort ( $key_val , SORT_DESC , $key_id , SORT_ASC , $devArray1 );
	$ryui  = $devArray1[0];
	$ryui2 = $devArray1[1];
	//--------------------------------
	//PDF出力
	//--------------------------------
	//PDF個人情報入力
	$make->makePdfKozin($pdf,$testdata,24);

	$pdf->SetFontSize(10);
	$pdf->Ln(2);
	//↓1.ストレス共生力↓
	$pdf->Write("5","1.要注意や危険が３つ以上ある場合は自身の言動をしっかり振り返りましょう");
	$pdf->Ln(5);
	
	$pdf->SetDrawColor(128, 128, 128);
	$pdf->SetXY(45, 54);
	$pdf->MultiCell(10,1, "20", 0);
	$pdf->SetXY(59, 54);
	$pdf->MultiCell(10,1, "30", 0);
	$pdf->SetXY(75, 54);
	$pdf->MultiCell(10,1, "40", 0);
	$pdf->SetXY(92, 54);
	$pdf->MultiCell(10,1, "50", 0);
	$pdf->SetXY(109, 54);
	$pdf->MultiCell(10,1, "60", 0);
	$pdf->SetXY(126, 54);
	$pdf->MultiCell(10,1, "70", 0);
	$pdf->SetXY(140, 54);
	$pdf->MultiCell(10,1, "80", 0);
	
	$pdf->Line(46.5, 57, 46.5, 69); //20
	$pdf->Line(61.5, 57, 61.5, 69); //30
	$pdf->Line(78, 57, 78, 69); //40
	$pdf->Line(95, 57, 95, 69); //50
	$pdf->Line(128, 57, 128, 69); //60
	$pdf->Line(144, 57, 144, 69); //70

	$pdf->Line(46.5, 70, 46.5, 82); //20
	$pdf->Line(61.5, 70, 61.5, 82); //30
	$pdf->Line(78,   70, 78,   82); //40
	$pdf->Line(95,   70, 95,   82); //50
	$pdf->Line(128,  70, 128,  82); //60
	$pdf->Line(144,  70, 144,  82); //70

	$pdf->Line(46.5, 83, 46.5, 95); //20
	$pdf->Line(61.5, 83, 61.5, 95); //30
	$pdf->Line(78,   83, 78,   95); //40
	$pdf->Line(95,   83, 95,   95); //50
	$pdf->Line(128,  83, 128,  95); //60
	$pdf->Line(144,  83, 144,  95); //70

	$pdf->Line(46.5, 100, 46.5, 112); //20
	$pdf->Line(61.5, 100, 61.5, 112); //30
	$pdf->Line(78,   100, 78,   112); //40
	$pdf->Line(95,   100, 95,   112); //50
	$pdf->Line(128,  100, 128,  112); //60
	$pdf->Line(144,  100, 144,  112); //70

	$pdf->Line(46.5, 113, 46.5, 125); //20
	$pdf->Line(61.5, 113, 61.5, 125); //30
	$pdf->Line(78,   113, 78,   125); //40
	$pdf->Line(95,   113, 95,   125); //50
	$pdf->Line(128,  113, 128,  125); //60
	$pdf->Line(144,  113, 144,  125); //70

	$pdf->Line(46.5, 126, 46.5, 138); //20
	$pdf->Line(61.5, 126, 61.5, 138); //30
	$pdf->Line(78,   126, 78,   138); //40
	$pdf->Line(95,   126, 95,   138); //50
	$pdf->Line(128,  126, 128,  138); //60
	$pdf->Line(144,  126, 144,  138); //70

/*
	$pdf->SetXY(84, 54);
	$pdf->MultiCell(10,1, "45", 0);
	$pdf->SetXY(96, 54);
	$pdf->MultiCell(10,1, "52", 0);
	$pdf->SetXY(109, 54);
	$pdf->MultiCell(10,1, "60", 0);
*/
	$pdf->SetDrawColor(0, 0, 0);

	$pdf->SetXY(156, 53);
	$pdf->MultiCell(20,3, "項目別", 0);
	$pdf->SetXY(178, 53);
	$pdf->MultiCell(25,3, "総合", 0);
	$pdf->SetXY(185, 53);
	$pdf->SetFontSize(7);
	$pdf->MultiCell(25,3, "(".$tate7."/10)", 0);
	$pdf->SetFontSize(9);

	$pdf->SetFontSize(8);
	$pdf->SetXY(11, 63);
	$pdf->MultiCell(3,3, "モ", 0,"L");
	$pdf->SetXY(10.8, 66);
	$pdf->MultiCell(3,3, "二", 0,"L");
	$pdf->SetXY(11.1, 69);
	$pdf->MultiCell(3,3, "タ", 0,"L");
	$pdf->SetXY(11.1, 72);
	$pdf->MultiCell(3,3, "リ", 0,"L");
	$pdf->SetXY(11.1, 75);
	$pdf->MultiCell(3,3, "ン", 0,"L");
	$pdf->SetXY(11.1, 78);
	$pdf->MultiCell(3,3, "グ", 0,"L");
	$pdf->SetXY(10.7, 81);
	$pdf->MultiCell(3,3, "領", 0,"L");
	$pdf->SetXY(10.7, 84);
	$pdf->MultiCell(3,3, "域", 0,"L");



	$pdf->SetFontSize(7);

	//$pdf->SetXY(15, 47);
	//$pdf->MultiCell(30,10, "", 1,"C");
	$pdf->SetXY(45, 47);
	$pdf->MultiCell(41.5,5, "1", 1,"C");
	$pdf->SetXY(86.5, 47);
	$pdf->MultiCell(11.5,5, "2", 1,"C");
	$pdf->SetXY(98, 47);
	$pdf->MultiCell(13.5,5, "3", 1,"C");
	$pdf->SetXY(111.5, 47);
	$pdf->MultiCell(33.5,5, "4", 1,"C");

	$pdf->SetFontSize(9);
	$pdf->SetXY(45, 52);
	$pdf->MultiCell(100,5, "", 1,"C");
	$pdf->SetXY(15, 57);
	$pdf->MultiCell(30,12, "対人共感リスク", 1,"L");
	$pdf->SetXY(15, 70);
	$pdf->MultiCell(30,12, "状況察知リスク", 1,"L");
	$pdf->SetXY(15, 83);
	$pdf->MultiCell(30,12, "業務分担リスク", 1,"L");

	//棒グラフの表示
	$pdf->Image($img1, 45, 60.5);
	$pdf->Image($img2, 45, 73.5);
	$pdf->Image($img3, 45, 86.5);
	$pdf->Image($img4, 45, 103.5);
	$pdf->Image($img5, 45, 116);
	$pdf->Image($img6, 45, 129);
	$strs = sprintf("%s",$tate7);
	if($tate7 == "10"){
		$pdf->Image($img7, 182, $arrays[ $tate7 ]-1);
	}else{
		$pdf->Image($img7, 182, $arrays[ $tate7 ]);
	}
	$pdf->SetXY(45, 57);
	$pdf->MultiCell(100,12, "", 1,"C");
	$pdf->SetXY(45, 70);
	$pdf->MultiCell(100,12, "", 1,"C");
	$pdf->SetXY(45, 83);
	$pdf->MultiCell(100,12, "", 1,"C");

	$pdf->SetFontSize(9);
	$pdf->SetXY(146, 57);
	$pdf->MultiCell(15,12, $dev7, 1,"C");
	$jp = getJpPoint($dev7);
	$pdf->SetXY(162, 57);
	$pdf->MultiCell(15,12, $jp, 1,"C");
	$pdf->SetXY(146, 70);
	$pdf->MultiCell(15,12, $dev8, 1,"C");
	$pdf->SetXY(162, 70);
	$jp = getJpPoint($dev8);
	$pdf->MultiCell(15,12, $jp, 1,"C");
	$pdf->SetXY(146, 83);
	$pdf->MultiCell(15,12, $dev2, 1,"C");
	$pdf->SetXY(162, 83);
	$jp = getJpPoint($dev2);
	$pdf->MultiCell(15,12, $jp, 1,"C");

	$pdf->SetDrawColor(0, 102, 255);
	$pdf->SetLineWidth(1.0);
	$pdf->Line(10.5, 98.0, 177, 98.0);
	$pdf->SetLineWidth(0.1);
	$pdf->SetDrawColor(0, 0, 0);


	$pdf->SetFontSize(8);
	$pdf->SetXY(11, 103);
	$pdf->MultiCell(3,3, "セ", 0,"L");
	$pdf->SetXY(10.8, 106);
	$pdf->MultiCell(3,3, "ル", 0,"L");
	$pdf->SetXY(11.1, 109);
	$pdf->MultiCell(3,3, "フ", 0,"L");
	$pdf->SetXY(11, 112);
	$pdf->MultiCell(3,3, "マ", 0,"L");
	$pdf->SetXY(11, 115);
	$pdf->MultiCell(3,3, "ネ", 0,"L");
	$pdf->SetXY(11, 118);
	$pdf->MultiCell(3,3, "ジ", 0,"L");
	$pdf->SetXY(11, 121);
	$pdf->MultiCell(3,3, "メ", 0,"L");
	$pdf->SetXY(11, 124);
	$pdf->MultiCell(3,3, "ン", 0,"L");
	$pdf->SetXY(11, 127);
	$pdf->MultiCell(3,3, "ト", 0,"L");
	$pdf->SetXY(10.7, 130);
	$pdf->MultiCell(3,3, "領", 0,"L");
	$pdf->SetXY(10.7, 133);
	$pdf->MultiCell(3,3, "域", 0,"L");

	$pdf->SetFontSize(9);
	$pdf->SetXY(15, 102.5);
	$pdf->MultiCell(30,4, "感情コントロール\nリスク", 0,"L");
	$pdf->SetXY(15, 115.5);
	$pdf->MultiCell(30,4, "ポジティブ思考\nリスク", 0,"L");

	
	$pdf->SetXY(15, 100);
	$pdf->MultiCell(30,12, "", 1,"C");
	$pdf->SetXY(15, 113);
	$pdf->MultiCell(30,12, "", 1,"C");
	$pdf->SetXY(15, 126);
	$pdf->MultiCell(30,12, "自己肯定リスク", 1,"L");


	$pdf->SetXY(45, 100);
	$pdf->MultiCell(100,12, "", 1,"C");
	$pdf->SetXY(45, 113);
	$pdf->MultiCell(100,12, "", 1,"C");
	$pdf->SetXY(45, 126);
	$pdf->MultiCell(100,12, "", 1,"C");

	$pdf->SetFontSize(9);
	$pdf->SetXY(146, 100);
	$pdf->MultiCell(15,12, $dev4, 1,"C");
	$pdf->SetXY(162, 100);
	$jp = getJpPoint($dev4);
	$pdf->MultiCell(15,12, $jp, 1,"C");

	$pdf->SetXY(146, 113);
	$pdf->MultiCell(15,12, $dev6, 1,"C");
	$pdf->SetXY(162, 113);
	$jp = getJpPoint($dev6);
	$pdf->MultiCell(15,12, $jp, 1,"C");
	$pdf->SetXY(146, 126);
	$pdf->MultiCell(15,12, $dev3, 1,"C");
	$pdf->SetXY(162, 126);
	$jp = getJpPoint($dev3);
	$pdf->MultiCell(15,12, $jp, 1,"C");


	//縦
	$pdf->SetXY(178, 57);
	$pdf->MultiCell(13,81, "", 1);
	
	//一番した
	$pdf->SetDrawColor(0, 102, 255);//青
	$pdf->Line(178, 57, 191, 57);
	$pdf->Line(178, 66, 191, 66);
	//$pdf->Line(167, 58.2, 182, 58.2);
	$pdf->SetXY(191,68);
	$pdf->MultiCell(9,3, "危険水域", 0);
	//点線
	setBotted($pdf,12,74,178);
	$pdf->Line(178, 82, 191, 82 );
	//点線終わり
	$pdf->Line(178, 90, 191, 90 );
	$pdf->Line(178, 98, 191, 98 );
	$pdf->SetXY(191,99);
	$pdf->MultiCell(12,3, "要注意水域", 0);
	//点線
	setBotted($pdf,12,106,178);
	$pdf->Line(178, 114, 191, 114);
	$pdf->SetLineWidth(0.1);
	//点線終わり
	$pdf->Line(178, 122, 191, 122);
	$pdf->Line(178, 130, 191, 130);
//	$pdf->Line(178, 138, 191, 138);
	$pdf->SetXY(191, 130);
	$pdf->MultiCell(9,3, "注意水域", 0);

	//$pdf->Line(91,57,91,58);
	$pdf->SetDrawColor(255, 0, 0);//赤
	setBottedTate($pdf,41,86.5,57);
	setBottedTate($pdf,41,98,57);
	setBottedTate($pdf,41,111.5,57);


	//$pdf->Line(167, 103 , 182, 103 );

	$pdf->SetFontSize(10);
	$pdf->Ln(4);
	$pdf->Write("5","2.パワハラリスクの全体傾向");
	$pdf->SetDrawColor(0, 0, 0);
	$sougo = (float)$tate7;

	if($sougo >= 0.5 && $sougo < 4){
		$p2 = 1;
	}
	if($sougo >= 4 && $sougo < 8){
		$p2 = 2;
	}
	if($sougo >= 8 ){
		$p2 = 3;
	}

	$pdf->SetXY(10, 145);
	$string =  str_replace(" ","",$aryStr1[$p2]);
	$pdf->MultiCell(190,30, "", 1);
	$pdf->SetXY(10, 147);
	$pdf->SetLeftMargin(11.5);	
	$pdf->MultiCell(190,4, $string,0);


	//var_dump($ryui);
	$rid = $ryui[ 'id' ];
	$rval = $ryui[ 'val' ];
	
	$rid2 = $ryui2[ 'id' ];
	$rval2 = $ryui2[ 'val' ];
	
	//テスト用
	if($_REQUEST[ 'rid' ]) $rid = $_REQUEST[ 'rid' ];
	if($_REQUEST[ 'rval' ]) $rval = $_REQUEST[ 'rval' ];
	
	if($rval >= 55){
		$val4 = $aryRyui[ $rid ][3];
		$val5 = $aryJyog[ $rid ][3];
		$val6 = $aryLang[ $rid ][3];

	}elseif($rval > 45 && $rval < 55){
		$val4 = $aryRyui[ $rid ][2];
		$val5 = $aryJyog[ $rid ][2];
		$val6 = $aryLang[ $rid ][2];

	}else{
		$val4 = $aryRyui[ $rid ][1];
		$val5 = $aryJyog[ $rid ][1];
		$val6 = $aryLang[ $rid ][1];
	}
	
	if($rval2 >= 55){
		$val7 = $aryLang[ $rid2 ][3];

	}elseif($rval2 > 45 && $rval2 < 55){
		$val7 = $aryLang[ $rid2 ][2];

	}else{
		$val7 = $aryLang[ $rid2 ][1];
	}
	$val4 = str_replace(" ","",$val4);
	$val5 = str_replace(" ","",$val5);
	$val6 = str_replace(" ","",$val6);
	$val7 = str_replace(" ","",$val7);

	$pdf->SetXY(10, 177);
	$pdf->Write("5","3.一番留意すべき項目の傾向");
	$pdf->SetDrawColor(0, 0, 0);
	$pdf->SetXY(10, 182.5);
	$pdf->MultiCell(94,40, "", 1);
	$pdf->SetXY(12, 184);
	$pdf->MultiCell(94,4, $val4);


	$pdf->SetXY(106, 177);
	$pdf->Write("5","4.一番、留意すべき項目についての道しるべ(助言)");
	$pdf->SetXY(106, 182.5);
	$pdf->MultiCell(94,40, "", 1);
	$pdf->SetXY(108, 184);
	$pdf->MultiCell(94,4, $val5);
	

	$pdf->SetXY(10, 224);
	$pdf->Write("5","5.こんな言動に身に覚えがありませんか？");
	$pdf->SetXY(10, 230);
	$pdf->MultiCell(94,5, "①".$ryui[ 'name' ], 1,"C");
	$pdf->SetXY(10, 235);
	$pdf->MultiCell(94,45, "", 1);
	$pdf->SetXY(12, 237);
	$list = $val6;
	$pdf->MultiCell(94,5, $list);

	$pdf->SetXY(106, 230);
	$pdf->MultiCell(94,5, "②".$ryui2[ 'name' ], 1,"C");
	$pdf->SetXY(106, 235);
	$pdf->MultiCell(94,45, "", 1);
	$pdf->SetXY(108, 237);
	$list2 = $val7;
	$pdf->MultiCell(94,5, $list2);

	$pdf->SetXY(10, 285);
	$pdf->SetFontSize(7);
	$pdf->Cell(192, 1, 'powered by Innovation Gate ,Inc.', 0,1,'R');

	//--------------------------------
	//作成した画像の削除
	//--------------------------------
	unlink($img1);
	unlink($img2);
	unlink($img3);
	unlink($img4);
	unlink($img5);
	unlink($img6);
	unlink($img7);

	//--------------------------------
	//作成した画像の削除終わり
	//--------------------------------
	//----------------
	//$loop:回転回数 $ht:縦位置
	//$st:スタート
	//----------------
	function setBotted($pdf,$loop,$ht,$st){
		for($i=0;$i<$loop;$i++){
			$st2 = $st+1;
			$pdf->Line($st,$ht,$st2,$ht);
			$st = $st+2;
		}
	}

	function setBottedTate($pdf,$loop,$ht,$st){
		for($i=0;$i<$loop;$i++){
			$st2 = $st+1;
			$pdf->Line($ht,$st,$ht,$st2);
			$st = $st+2;
		}
	}
	function getLimit($limit){
		if($limit >= 80){
			$limit = 80;
		}elseif($limit <= 20){
			$limit = 20;
		}
		return $limit;
	}
	function getJpPoint($int){
		if($int < 45 ){
			$str = "-";
		}elseif($int >= 45 && $int < 52){
			$str = "注意";
		}elseif($int >= 52 && $int < 60){
			$str = "要注意";
		}elseif($int >= 60){
			$str = "危険";
		}
		return $str;
	}
	function getPoint($point){
		if($point[ 'type' ][ 'sougo' ] > 0){
			$pt = ($point[ 'type' ][ 'sougo' ] >= 10)?10:$point[ 'type' ][ 'sougo' ];
			return $pt;
		}
		$pt = 0.5;
		$p1 = $point[ 'type' ][ 'dev6' ]-$point[ 'type' ][ 'dev7' ];
		$p2 = $point[ 'type' ][ 'dev3' ]-$point[ 'type' ][ 'dev4' ];
		$p3 = $point[ 'type' ][ 'dev8' ];
		$p4 = $point[ 'type' ][ 'dev2' ];
		$p5 = $point[ 'type' ][ 'dev11' ]-$point[ 'type' ][ 'dev7' ];

		if($p1 >= 5 && $p1 < 10){
			$pt += 3;
		}elseif($p1 >= 10){
			$pt += 4;
		}
		if($p2 >= 5 && $p2 < 10){
			$pt += 2;
		}elseif($p2 >= 10){
			$pt += 3;
		}
		if($p3 < 45){
			$pt += 1;
		}
		if($p4 >= 52){
			$pt += 0.5;
		}
		if($p5 >= 5){
			$pt += 1;
		}
		$pt = sprintf("%s",($pt >= 10)?$pt:$pt);
		return $pt;
	}

?>