<?PHP
	$array_image = array(
						"1"=>"感情を素直に出し、自分の気持ちを伝えようとする意識が高くないようです。人柄や真意が伝わらず誤解さ\nれているかもしれません。感情を出してはいけないと考えている可能性もあります。"
						,"2"=>"自分の感情を素直に出そうとする意識はあまり高くないようです。人柄や真意が伝わりづらく、理解しにく\nい人だと思われているかもしれません。自分の気持ちを伝えることも大切です。"
						,"3"=>"自分の感情をある程度は素直に表現しようと意識しているようです。場面によっては意識的に表現を抑える\nこともできる可能性があります。バランス良く表現する術を更に磨いても良いでしょう。"
						,"4"=>"自分の感情を素直に出し、喜怒哀楽を率直に伝えようと意識しているようです。周囲からはわかりやすい人\nと受け止められていると思われます。但し、場への配慮が必要な時もあるでしょう。"
						,"5"=>"自分の感情を素直に出し、喜怒哀楽を率直に伝えようと強く意識しているようです。周囲からも感情が一目\n瞭然な場合が多いでしょう。周囲の関心を引きたいという意識が強い可能性もあります。"
					);
	$array_opinion = array(
						"1"=>"自分の考えをはっきり主張しようとはしておらず、嫌なことでも断らず反論もしないようです。そもそも伝\nえようとする意識が高くないか、現状では主張しても無駄だと考えている場合もあります。"
						,"2"=>"自分の考えをあまりはっきり主張せず、嫌なことでも反論したり、断ることは少ないようです。伝えようと\nする意識があまり高くないか、敢えて言わなくても良いと考えている場合もあります。"
						,"3"=>"自分の考えを主張しようとある程度意識しているようです。言い過ぎることなく反論や断りも行い、バラン\nス良く主張するでしょう。但し、場合によっては気後れすることがあるかもしれません。"
						,"4"=>"自分の考えをはっきり主張しようと意識しているようです。状況に応じて反論や断りもしているでしょう。\nどんな相手にも臆せず意見しますが、言い過ぎてしまわないように注意しましょう。"
						,"5"=>"自分の考えをはっきり主張しようと強く意識しているようです。自分が不快であることを率直に伝えている\nでしょう。誰にでも臆せず意見しますが、相手への配慮をいつも心がけましょう。"
					);
	$array_nonverval = array(
						"1"=>"話をする際の自分の表情や、身振りなどのジェスチャーに特に意識が向いていないようです。あえて、使お\nうとしない、必要ではない、あるいは苦手だと思い込んでいる可能性もあります。"
						,"2"=>"話をする際の自分の表情や、身振りなどのジェスチャーにあまり意識が向いていないようです。そのため、\n伝えたいことが伝えきれていない可能性もあるので、もっと使っても良いかもしれません。"
						,"3"=>"話をする際、自分の表情や身振りなどのジェスチャーも使おうと意識しているようです。ある程度、伝えた\nいことを表現できているようですが、適切に使い分けられているかも意識してみましょう。"
						,"4"=>"話をする際、表情豊かに、身振りなどのジェスチャーも使いこなそうと意識しているようです。伝えたいこ\nとを効果的に表現できる可能性がありますが、若干大げさな印象になるかもしれません。"
						,"5"=>"話をする際、表情豊かに、身振りなどのジェスチャーも上手に使いこなそうと意識しているようです。伝え\nたいことを伸びやかに効果的に表現しますが、大げさな印象になるリスクもあります。"
					);
	

	$array_guess = array(
						"1"=>"人の表情・態度や言葉のニュアンスを読み取ろうとする意識が高くないようです。そのため人の気持ちや真\n意に気づかないかもしれません。言語以外の情報を重視していない可能性があります。"
						,"2"=>"人の表情・態度や言葉のニュアンスを読み取ろうとする意識があまり高くないようです。人の気持ちや真意\nが汲み取れない可能性があります。言葉に捉われすぎないようにしましょう。"
						,"3"=>"ある程度は人の表情・態度や言葉のニュアンスを読み取ろうと意識しているようです。相手によっては、言\n葉を表面的に受け取ってしまうので、背景にある気持ちにも関心を向けてみましょう。"
						,"4"=>"人の表情・態度や言葉のニュアンスを敏感に察知しようし、気持ちや真意を感じ取ろうと意識しているよう\nです。但し、人の気持ちに気を遣いすぎて疲れないようにしましょう。"
						,"5"=>"人の表情・態度や言葉のニュアンスを敏感に察知しようとし、気持ちや真意を感じ取ろうと強く意識してい\nるようです。但し、気にしすぎや、自分の思い込みに注意しましょう。"
					);
	
	$array_situation = array(
						"1"=>"その場の状況や接している相手の反応に対する意識が高くないようです。相手の状態にかまわず自分のペー\nスで行動してしまう可能性があります。他人を気にかける余裕がない場合も考えられます。"
						,"2"=>"その場の状況や接している相手の反応に対する意識があまり高くないようです。相手の状態を正確に把握し\nきれない場合があるかもしれません。もっと相手の反応に注意を払ってみましょう。"
						,"3"=>"ある程度はその場の状況や接している相手の反応を察知しようとする意識があるようです。但し自分の思い\nが強過ぎたり、対象者によっては、反応を見過ごしてしまう場合があるかもしれません。"
						,"4"=>"その場の状況や接している相手の反応を敏感に察知しようとし、場の空気や話の流れを読み取ろうと意識し\nているようです。但し相手の反応を読むことに気を遣いすぎて疲れないようにしましょう。"
						,"5"=>"その場の状況や接している相手の反応を敏感に察知しようとし、場の空気や話の流れを読み取ろうと強く意\n識しているようです。但し、相手の反応に過敏になり過ぎないように注意しましょう。"
					);
	$array_sympathy = array(
						"1"=>"相手の置かれた状況や視点に立ち、話を聴こうとする意識が高くないようです。そのため、一方的な解釈を\nしてしまう可能性があります。心理的・時間的な余裕を失っている場合もあります。"
						,"2"=>"相手の置かれた状況や視点に立ち、話を聴こうとする意識があまり高くないようです。聴く姿勢はあるよう\nですが、理解しきれない可能性があります。特定の人への関心が低い場合も考えられます。"
						,"3"=>"ある程度は相手の置かれた状況や視点に立ち、話を聴こうとする意識はあるようです。的確に理解できる可\n能性が高いですが、焦って結論を出そうとしてしまう場合は相手への影響を考えましょう。"
						,"4"=>"いつも相手の置かれた状況や視点に立ち、話を聴こうと意識しているようです。気持ちと思考をたどり、話\nを理解しようとするため、相手は自分が受け入れられたと感じる可能性が高いでしょう。"
						,"5"=>"いつも相手の置かれた状況や視点に立ち、話を聴こうと強く意識しているようです。相手の気持ちを受け入\nれ、思考をたどり話を理解しようとしますが、“わかったつもり”には注意しましょう。"
					);
?>