<?PHP
$strong_array=array(
				1=>"物事の概要や全体像をとらえ業務を進めることを好みます。要点をつかみポイントを押さえるのが得意な一方で、思いついたことを脈絡なく提示する可能性があります。詳細な部分に長時間集中することに苦手意識をもつ場合もあるでしょう。"
				,2=>"物事の細かい部分をとらえるのを得意としています。細部にわたって細やかな神経を配る業務で能力を発揮します。詳細な部分まで情報を語ろうとしますが、全体像や概要をとらえて端的に要約することに苦手意識を持つ場合もあります。"
				,3=>"目標を達成するという観点から物事を考えると意気が高まり生き生きとします。目標を達成することにエネルギーを注ぎ意欲的ですが、間違いや問題の存在に気づきにくいことやリスク回避が得意ではない場合もあるでしょう。"
				,4=>"避けたい事態や解決すべき問題を意識し、起こりうる障害を予測することが得意で、それを回避しようとするとき行動力が増します。「何がうまくいかないか」に注意がいくため、状況によっては目標達成に向けた優先順位を忘れることもあります。"
				,5=>"率先して行動を起こすのを得意とし、何かにすぐ取りかかることができると意欲が高まります。行動することでモチベーションが上がるため、状況によってはよく考えず行動してしまうことや、相手が行動を起こすまで待てない場合もあるでしょう。"
				,6=>"行動を起こす前に現状把握・熟慮することを得意とし、周囲の人の行動を観察し、他者の要求に答えようとします。機が熟してから行\n動を起こそうとする傾向があり、状況によっては何かが起こるのを待ってしまいタイミングを逃すこともあるでしょう。"
				,7=>"今までとは違った方法や様々な可能性が選択できる環境に魅力を感じます。無限の可能性に心がときめき、手順や仕組みを作り出すことに意欲を感じますが、それに従って一つの手順通りに専念し続けることには、苦手意識を持つ場合があります。"
				,8=>"既存の方法に従うことを好み、一度やり始めると一つずつ進め最後までやり遂げることを大切にします。手順がわかれば効率よく働き完成に向かいますが、状況によってはそれが唯一正しい手順だと考え、その方法に固執する場合もあるでしょう。"
				,9=>"変化は好まず、長期間安定した状態であることを望みます。変化を伴わない業務に向いており、安定維持させることを得意とします。１０年以上の単位の変化は受け入れますが、頻繁に変化が起こる環境下ではストレスを感じる場合もあるでしょう。"
				,10=>"状況が段階的に少しずつ変化し、進展していくことに心地良さを覚えます。 改善しながら進めることでやる気になり、変化にも比較的柔軟に対応できますが、劇的な変化や変化に乏しい環境下では、やりにくさを感じる場合があるでしょう。"
				,11=>"頻繁に大きな変化や改革を好み、計画が変更になっても順応できます。 革新的なアイデアを生み出すことや変化を生きがいとしているので、大きな変化があるとやる気が継続しますが、変化のない安定した状況には抵抗を覚える場合があります。"
				,12=>"チーム一丸となって皆の共同責任で仕事に取り組むことを望みます。チームと関わりを持ちながら働く共同作業を好み、皆と一緒にい\nる環境下では能力を発揮しますが、全くの一人になるとモチベーションが下がることがあります。"
				,13=>"自分の責任の所在や権限領域を明確にしながら、他者との関わりを持ち業務を進めることを好みます。周囲に人がいる環境では能率的\nに仕事を進めることができますが、完全に一人で進める環境下ではモチベーションを下げる場合があります。"
				,14=>"職場で単独で仕事をすることを好み、全ての責任を自分で負うことを望みます。誰にも邪魔されず一人の環境下にあると能率的に業務\nをこなしますが、他人が側にいる場合や皆で責任分担しなければならないと、生産的になれない場合があります。"
				,15=>"仕事について考えた時、時間内の成果や結果といったタスクに関心が向き、目の前の業務を完遂することを大事にします。一方で、状\n況によっては自分や相手の感情や気持ちにあまり意識を向けず仕事志向にみられる場合もあるでしょう。"
				,16=>"自分や他人の気持ち・感情に注意をおき、人と信頼関係を築くのが得意です。人への想いや感情を仕事に結びつけ、関係を重視しなが\nら仕事を進めます。そのため感情に縛られたり、仕事に感情を持ちこんだりする傾向があるでしょう。"
				,17=>"自分にとって効果的な方法は他者にも有効と考え、相手に望むことなどをはっきりと伝えることができます。自分の考え方を他者に適\n用するため、状況によっては個々人のやり方や組織全体のルールを尊重できない場合があります。"
				,18=>"自分のやり方やルールよりも、組織のルールを大切に考え従おうとし、他人もそれに従うことを求めます。ルールが与えられると自分にも適用しようとしますが、自分自身で意思決定し、または個々人のルールを容認することが苦手な場合もあります。"
				,19=>"人はみな違っており、自分には自分の、相手には相手の考え方やルールがあると考え尊重します。自分のルールは持っていますが、人\nにはそれぞれのやり方があると考えるため、他人に意見することには抵抗を感じる場合があります。"
			);

$weak_array=array(
				1=>"物事を概念・抽象的にとらえるのは得意ではありません。全体像を把握しながら進める業務を任せられると戸惑うこともあります。要点のみを伝えられると理解しにくいことがありますが、詳細な情報があると理解しやすい場合があります。"
				,2=>"詳細な情報に着目したり、細部にわたる具体的な表現は得意ではありません。 場合によっては、話している内容が正確に伝わらず、真意を理解してもらえないこともあるでしょう。修飾語や詳細な説明は少なく、大まかな説明をする傾向があります。"
				,3=>"目標に注意を向け続けることが得意ではありません。そのため、到達目標がやる気を引き出すきっかけにはなりません。 目標達成のための優先順位は見失うことがありますが、差し迫った課題やリスクには意識を向けることがあります。"
				,4=>"問題点に意識を向けるのが得意ではありません。上手くいかない可能性もあることを認めないところがあったり、問題が起こるとどのように対応すればよいか想定し難いこともありますが、リスクに囚われずに進めることもできます。"
				,5=>"主体的に行動することが得意ではなく、なかなか行動に移さない傾向があります。素早い行動を自ら起こすことを求められるとストレスに感じたり不安になることもありますが、周囲の状況を見守り待つことができるでしょう。"
				,6=>"状況を分析したり熟慮したりすることは得意ではありません。立ち止まって省みたり周囲の反応を伺ったりすることが比較的少なく、\n時には性急に事を進めてしまうこともありますが、あまり考えすぎずに行動を起こすことができます。"
				,7=>"すでに進行していることについて別の選択肢を考えたり、変更することを好みません。多くの選択肢が提示されると選ぶことに難しさ\nを感じます。従うべき手順がないと戸惑う場合がありますが、既存のやり方に従うことは難しくないでしょう。"
				,8=>"既存のやり方に従い、同じことを繰り返し最後までやり遂げることが得意ではありません。手順を順守し、正確に一つ一つ進めていくことにはやる気が起きない場合もありますが、従来のやり方に縛られず業務を進めることができるでしょう。"
				,9=>"長期にわたり同じ業務を安定的に継続させることは得意ではありません。 変化が伴わない業務に関しては、やる気が起こらないこともあります。安定を長期間維持することよりも、変化に対応・順応することのほうが楽にできるでしょう。"
				,10=>"段階的に少しずつ発展や改善を進め継続させることが得意ではありません。 微調整をしながら常に進展し続ける状況下では、本来の能力を発揮できない場合があります。自分のペースで進められる業務のほうが能力を発揮するでしょう。"
				,11=>"変化の激しい環境や革新的なアイデアに順応するのは得意ではありません。劇的な変化や改革に適応することよりも、自分のペースが守られた中でいつもの状況に対応し、または継続的に業務を進めるほうがやりやすく感じるでしょう。"
				,12=>"チームでの共同作業が得意ではなく、個々の責任分担が明確でないと快適に働くことができません。業務中チームメンバーとの社交的な関わりに時間を割くよりも、自分のペースで仕事を進めるほうが能率的に業務をこなします。"
				,13=>"自分が指揮をとり個の責任や仕事の領域をきちんと明確にしながら、他人と常に関わり共に仕事を進めるのはあまり得意ではありませ\nん。個人、あるいは、チーム全員で進めるか、そのどちらかのほうが能率的に作業を進められるでしょう。"
				,14=>"自分が単独で仕事をし、全ての責任を自分が負うことを好みません。責任と権限がすべて自分にかかり一人で仕事をするよりも、責任\nを分担し、他の人と関わりを持ちながら進める業務のほうがモチベーションも上がり生産的になれるでしょう。"
				,15=>"仕事をする上で、時間内にタスクを完遂して結果を出すことへの関心があまり高くありません。タスクの達成や物質的な価値を重要視\nするよりも、自分や人の気持ちや感情を大事にする傾向があるかもしれません。"
				,16=>"自分や他人の気持ち・感情について、あまり意識を向けない場合があります。人への想いを仕事に結びつけたり、他者の感情をとらえ\nたりすることは得意でない場合もありますが、人の感情に影響を受けずに仕事を進めることができます。"
				,17=>"自分で何かを決めなくてはいけないとき、自分にとって良い方法や自分のルールを明確にし難いため、どのようにすれば良いか戸惑う\nことがあります。自分のルールを他人に適用しないため、相手に押し付けるようなことはありません。"
				,18=>"与えられた組織のルールを遵守し従うことに難しさを感じます。自分が従うべき組織的なルールを守るよりも、個々人のやり方やルー\nルを持った立場のほうが行動しやすい傾向があります。"
				,19=>"人はそれぞれ違っており、個々人のやり方を尊重して見守るという意識を持ちにくい傾向にあります。他者の自由な考え方やルールを\n尊重することに難しさを感じますが、自分自身が納得するルールに従って行動する傾向があります。"
			);


$comment = array(
		"score1"=>array(
					"1"=>array(
						"意識のスケール"
						,"物事を全体像や概念的に捉える傾向があり、視野が広がるとやる気が出ます。大枠をとらえポイントをついた簡潔な表現を好みます。\n全体像を把握しながら関連ある事柄を見つけだすのが得意なので、戦略的な企画立案のような仕事に向いています。一方で、詳細な説\n明に苦手意識を持つ場合があり、思いついたことを脈絡なく提示することもあるでしょう。これから話すことの順序やステップを具体\n的に示して伝えるようにするとさらに良いでしょう。【特徴的言語  】全体像、概要、ポイント"
					)
				)
		,"score2"=>array(
					"1"=>array(
						"意識のスケール"
						,"物事の細かい部分をとらえるのを得意としています。細部にわたって細やかな神経を配り正確に仕事をこなせるので、管理的な業務で\n能力を発揮します。詳細な部分まで情報を把握したり伝えたりしますが、全体像をとらえて要約・発信することには苦手意識を持つ場\n合があります。人に何かを伝えるときは、「このことの要点・結論は何か？」「これが意味することは何か？」という視点を最初にお\nさえた上で、具体的な話をするとさらに良いでしょう。【特徴的言語  】具体的、詳細、順序"
					)
				)
		,"score3"=>array(
					"1"=>array(
						"モチベーションの方向"
						,"目標を達成するという観点から物事を考えると、志気が高まり生き生きとします。目標達成にエネルギーを注ぎ、意欲的に取り組むこ\nとができます。リーダーシップをとる役割や、プロジェクト推進、営業などの業務で能力を発揮します。 一方で、リスク回避という\n意識をあまり持たない場合もあり、間違いや問題の存在に気づかないこともあるでしょう。「起こりうる問題は何か？」「それにどう\n対処するか？」を意識するとさらに成果を達成しやすくなるでしょう。【特徴的言語  】達成、成果、目的"
					)
				)
		,"score4"=>array(
					"1"=>array(
						"モチベーションの方向"
						,"解決すべき事態や避けたい問題を発見することが得意で、それを回避しようとするとき行動力が高まります。リスク管理を担う役割である、監査、品質管理、クレーム対応などの業務で能力を発揮します。一方で、問題点やうまくいかないことに注意がいくため、状況によっては目標達成に向けた優先順位を見失うこともあるでしょう。「手に入れたい結果や目的は何か？」を意識することで、さらに\n問題を把握できるでしょう。【特徴的言語  】問題、リスク、避ける"
					)
				)
		,"score5"=>array(
					"1"=>array(
						"業務の取組み方"
						,"率先して行動を起こすのを得意とし、何かにすぐ取りかかることができると意欲が高まります。行動を起こすことでモチベーションが上がるため、営業の新規開拓、起業家、経営者など、主体的な行動を求められる役割で能力を発揮します。一方で、状況によってはよく考えずに行動してしまうことや、相手が行動を起こすまで待てない場合があるでしょう。行動する際に、起こりうる結果やシナリオを考えてみると、さらに行動の成果が高まるでしょう。【特徴的言語  】今すぐ、着手、行動"
					)
				)
		,"score6"=>array(
					"1"=>array(
						"業務の取組み方"
						,"物事をじっくり考え、状況を把握することを得意としています。しっかりとした考えなしに行動することはなく、周囲の人の言動をよく観察し要求に答えようとします。我慢強く分析が得意なので、資料作成、経営計画、コンサルティングなどの業務で能力を発揮します。一方、機が熟してから行動を起こそうとする傾向があるため、状況によっては旬なタイミングを逃す場合もあるでしょう。まず行動してみてから考えることで、さらに理解が深まることがあるでしょう。【特徴的言語  】分析、考察、忍耐"
					)
				)
		,"score7"=>array(
					"1"=>array(
						"選択行動の傾向"
						,"従来のやり方に固執せず、新しい方法や様々な可能性が選択できると意欲が高まります。創造的な発想が求められる企画、商品開発や、環境変化が激しい経営などの仕事でも能力を発揮するでしょう。新しい手順や仕組み作ることにやりがいを感じますが、それに従い\n専念し続けることには苦手意識を持つ場合があるでしょう。物事を推進するための正しい手順や方法を考えることで、さらに可能性を\n広げることができるでしょう。【特徴的言語  】可能性、選択肢、多様性"
					)
				)
		,"score8"=>array(
					"1"=>array(
						"選択行動の傾向"
						,"正しい手順や既存の方法に従うことを好み、一度やり始めると手順通り進め、最後までやり遂げることを大切にします。経理財務、シ\nステム設計、医療など、正しい手順が強く求められる仕事で能力を発揮するでしょう。一方で、状況によっては既存の方法が唯一正し\nい手順だと考え、その方法から抜け出せない場合もあるでしょう。 複数のやり方を検討し柔軟に選択するようにすると、さらに正し\nく効率的な手順で仕事を推進できるでしょう。【特徴的言語  】手順、プロセス、正しい方法"
					)
				)
		,"score9"=>array(
					"1"=>array(
						"変化への対応"
						,"長期にわたって安定した状態であることを好みます。変化を伴わない業務に向いており、一定の環境が安定的に維持させることを望みます。管理、経理、製造ラインなどの定型的業務で能力を発揮します。一方で、少しずつ発展や改善を進め継続させることには苦手意識を持つ場合もあるでしょう。微調整をしながら常に進展し続ける状況下では、その中に従来と変わらない部分や共通の要素を見出すようにすると、安定したペースを見出せるでしょう。【特徴的言語  】安定、同じ、共通"
						)
					,"2"=>array(
						"変化への対応"
						,"長期にわたって安定した状態であることを好みます。変化を伴わない業務に向いており、一定の環境が安定的に維持させることを望みます。管理、経理、製造ラインなどの定型的業務で能力を発揮します。状況によっては１０年以上の単位の変化は受け入れますが、頻繁に変化が起こる環境下ではストレスを感じる場合もあるでしょう。 変化が激しいと感じるときは、その中に従来と変わらない部分\nや共通の要素を見出すようにすると、安心して受け入れられるでしょう。【特徴的言語  】安定、同じ、共通"
						)
					)

		,"score10"=>array(
					"1"=>array(
						"変化への対応"
						,"状況が段階的に少しずつ変化し、進展していくことに心地良さを覚えます。 改善しながら進めることでやる気になり、変化にも比較的柔軟に対応ができます。 改善活動を伴うプロジェクト推進やマネジメント業務で能力を発揮するでしょう。一方で、変化が伴わない業務に関しては、状況によってはやる気が起きにくいこともあるでしょう。 従来と同じ業務であっても、どのように進歩させるか工夫することで、段階的な発展を図ることができるでしょう。【特徴的言語  】改善、進歩、発展"
						),
					"2"=>array(
						"変化への対応"
						,"状況が段階的に少しずつ変化し、進展していくことに心地良さを覚えます。 改善しながら進めることでやる気になり、変化にも比較的柔軟に対応ができます。 改善活動を伴うプロジェクト推進やマネジメント業務で能力を発揮するでしょう。一方で、頻繁に大きな変化があると、状況によってはやる気が起きにくいこともあるでしょう。変化が大きい仕事であっても、どのように少しずつ進歩させるか工夫することで、段階的に発展させることができるでしょう。【特徴的言語  】改善、進歩、発展"
						)
					)
		,"score11"=>array(
					"1"=>array(
						"変化への対応"
						,"頻繁に大きな変化や改革を好み、計画が変更されてもすぐに順応できます。 革新的なアイデアや変化に対応することでやる気が出ます。ベンチャー、ハイテク企業など、変化に富む仕事環境で能力を発揮するでしょう。一方で、人の先を行く変革意識が、状況によっ\nては周囲に受け入れられないこともあるでしょう。新たな提案をする際は、従来と変わらない部分や共通の要素に基づいて説明すると\n、周囲にも革新的な考えを受け入れてもらえるでしょう。【特徴的言語  】変化、新しい、違い"
						),
					"2"=>array(
						"変化への対応"
						,"頻繁に大きな変化や改革を好み、計画が変更されてもすぐに順応できます。 革新的なアイデアや変化を生み出すことでやる気が出ます。ベンチャー、ハイテク企業など、変化に富む仕事環境で能力を発揮するでしょう。一方で、人の先を行く変革意識が、状況によっ\nては周囲に受け入れられないこともあるでしょう。新たな提案をする際は、現状を段階的に改善する観点を加えて説明すると、周囲に\nも革新的な考えを受け入れてもらえるでしょう。【特徴的言語  】変化、新しい、違い"
						)
					)
		,"score12"=>array(
					"1"=>array(
						"仕事のスタイル"
						,"皆の共同責任でチーム一丸となって仕事に取り組むことを望みます。チームと関わりを持ちながら働く共同作業を好み、皆と一緒にチ\nームで働く、教育、福祉、販売などの業務で能力を発揮するでしょう。一方で、自分が指揮をとり、個の責任や仕事の領域をきちんと\n明確にしながら仕事を進めることには、苦手意識を持つ場合があるでしょう。責任の所在を明らかにすることで、より多くのメンバー\nと連携して仕事を進められるようになるでしょう。【特徴的言語  】共同、一緒、チーム"
						),
					"2"=>array(
						"仕事のスタイル"
						,"皆の共同責任でチーム一丸となって仕事に取り組むことを望みます。チームと関わりを持ちながら働く共同作業を好み、皆と一緒にチ\nームで働く、教育、福祉、販売などの仕事で能力を発揮するでしょう。一方で、自分が単独で仕事をし、全ての責任を自分が負うこと\nは好まない場合があるでしょう。チーム全体で進める仕事でも、個人の責任の所在を明らかにすることで、より多くのメンバーと連携して仕事を進められるようになるでしょう。【特徴的言語  】共同、一緒、チーム"
						)
					)
		,"score13"=>array(
					"1"=>array(
							"仕事のスタイル"
							,"自分の責任の所在や権限領域を明確にしながら、他者と一定の関わりを持ち業務を進めることを好みます。メンバーの責任の所在を説\n明できるため、プロジェクト管理や人事などの仕事で能力を発揮するでしょう。一方で、チームの共同責任で仕事を進める状況におい\nては、やる気が起きにくい場合もあるでしょう。チーム全体で進める仕事においては、自分が主体的に個人の仕事の領域や責任範囲を\n明確にして分担することで、より快適に働くことができるでしょう。【特徴的言語  】責任範囲、分担"
						),
					"2"=>array(
						"仕事のスタイル"
						,"自分の責任の所在や権限領域を明確にしながら、他者と一定の関わりを持ち業務を進めることを好みます。メンバーの責任の所在を説\n明できるため、プロジェクト管理や人事などの仕事で能力を発揮するでしょう。一方で、自分が単独で仕事をし、全ての責任を自分が\n負うことは好まない場合もあるでしょう。単独での仕事においては、積極的にメンバーと関わり、プロジェクト全体における仕事の領\n域や責任範囲を明確にするよう働きかけるとさらに良いでしょう。【特徴的言語  】責任範囲、分担"
						)
					)
		,"score14"=>array(
					"1"=>array(
						"仕事のスタイル"
						,"職場で単独で仕事をすることを好み、全ての責任を自分で負うことを望みます。一人で集中し自分の責任で進められると能率的に業務\nをこなせるため、専門職、技術者、クリエーターなどの仕事が向いているでしょう。一方で、状況によっては皆で責任を分担しチーム\n全体で共同作業をすることに苦手意識を持つ場合もあります。チームで進める仕事においては、できるだけ自分と関係者の仕事の領域\nや責任範囲を明確にすることで、より自分の仕事に集中できるようになるでしょう。【特徴的言語  】個人責任、一人、独立"
						),
					"2"=>array(
						"仕事のスタイル"
						,"職場で単独で仕事をすることを好み、全ての責任を自分で負うことを望みます。一人で集中し自分の責任で進められると能率的に業務\nをこなせるため、専門職、技術者、クリエーターなどの仕事が向いているでしょう。一方で、自分が指揮をとり、個の責任や仕事の領\n域をきちんと明確にしながら仕事を進めることには、苦手意識を持つ場合もあるでしょう。チームで進める仕事においては、他者との\n仕事の領域や責任範囲を明確にするよう働きかけ、自分の仕事に集中できるようにすると良いでしょう。【特徴的言語  】個人責任、\n一人、独立"
						)
					)
		,"score15"=>array(
					"1"=>array(
						"重視する要素"
						,"仕事について考えた時、時間内の成果や結果といったタスクに関心が向き、目の前の業務を完遂することに主眼をおきます。仕事を時\n間内に完了させることを大事にするため、プロジェクトの推進・管理に能力を発揮するでしょう。一方、状況によっては仕事に集中す\nるあまり周囲の人の感情を意識しにくい場合もあるでしょう。仕事を推進する際、より関係者の感情に配慮する働きかけをすることで\n、結果として効率的にタスクが完遂するでしょう。【特徴的言語  】タスク、成果、結果"
						)
					)
		,"score16"=>array(
					"1"=>array(
						"重視する要素"
						,"自分や他人の気持ち・感情に注意をおき、人と信頼関係を築くのが得意です。人への想いや感情を仕事に結びつけ、関係を重視しなが\nら仕事を進めます。教育、販売、顧客対応などの仕事で能力を発揮するでしょう。一方で、人への感情的配慮に比べると、時間内にタ\nスクを完遂して結果を出すことへの意識があまり高くない場合があります。一緒に働く人たちの気持ちを大事にしつつ、皆で協力して\n時間内に成果を出し、共に分かち合えるよう働きかけると良いでしょう。【特徴的言語  】気持ち、感情、人"
						)
					)
		,"score17"=>array(
					"1"=>array(
						"ルールの適用"
						,"自分にとって効果的な方法は他者にも有効と考え、自分の考え方や相手に望むことなどをはっきりと伝えることができます。ベンチャ\nー経営者、専門職、コンサルタントなどの仕事で能力を発揮します。一方で、組織のルールを遵守することよりも、自分の考え方を重\n視し結果的に相手にそれを押し付けてしまう場合もあるでしょう。自分のやり方以外にも良い方法があることにも注意を向けながら、\n自分の意見を伝えるようにすると良いでしょう。【特徴的言語  】「もし私があなたらなら」「～すべき」"
						),
					"2"=>array(
						"ルールの適用"
						,"自分にとって効果的なことは他者にも有効と考え、自分の考え方や相手に望むことをはっきりと伝えることができます。ベンチャー経\n営者、専門職、コンサルタントなどの仕事で能力を発揮します。一方で、状況によっては他者の自由な考え方やそれぞれのやり方を尊\n重しにくい場合があるでしょう。自分のルールを尊重するのと同じように、各人の異なるやり方や考え方を尊重しつつ、自分の意見を\n他者に伝えるとさらに良いでしょう。【特徴的言語  】「もし私があなたらなら」「～すべき」"
						)
					)
		,"score18"=>array(
					"1"=>array(
						"ルールの適用"
						,"組織のルールを大切に考え従おうとし、他人にもそれに従うことを求めます。ルールや方針が与えられるとやりやすさを覚えます。\n規則を遵守することが求められる、監査・監理業務、安全・品質管理などの仕事で能力を発揮します。一方で、状況によっては自分の\n意見や自由な考え方を持ち主張することに、難しさを感じる場合もあるでしょう。自分の意見や各人の異なるやり方や考え方も尊重し\nながら、組織全体の規律を円滑にしていくとさらに良いでしょう。【特徴的言語  】規則を守る、順応する、従う"
						)
					,"2"=>array(
						"ルールの適用"
						,"組織のルールを大切に考え従おうとし、他人にもそれに従うことを求めます。ルールや方針が与えられるとやりやすさを覚えます。\n規則を遵守することが求められる、監査・監理業務、安全・品質管理などの仕事で能力を発揮します。一方で、状況によっては他者の\n自由な考え方やそれぞれのやり方を尊重しにくい場合があるでしょう。組織のルールを守りながらも、各人の異なるやり方や考え方を\n尊重するような関わりを持つとさらに良いでしょう。【特徴的言語  】規則を守る、順応する、従う"
						)
					)
		,"score19"=>array(
					"1"=>array(
						"ルールの適用"
						,"人は各々異なり、自分には自分の、相手には相手のやり方やルールがあると考え尊重します。相手を寛容する立場で関わる、チームリ\nーダー、コーチ、カウンセラーのような役割が向いているでしょう。一方で、状況によっては自分の意見や自由な考え方を持ち主張す\nることに難しさを感じる場合もあるでしょう。そのため、何を考えているのか理解されにくいこともあります。自分の考え方や意見を\n他者に伝えることで、相互理解が深まるでしょう。【特徴的言語  】容認、尊重、任せる"
						)
					,"2"=>array(
						"ルールの適用"
						,"人はそれぞれ異なり、自分には自分の、相手には相手の考え方やルールがあると考え尊重します。相手を寛容する立場で関わる、チー\nムリーダー、コーチ、カウンセラーのような役割が向いているでしょう。一方で、人それぞれのルールを尊重するため、状況によっては組織のルールを遵守し従うことに難しさを感じる場合もあるでしょう。各人の異なる考え方を尊重しつつ、組織のルールも大切にすることで、個人と組織それぞれの役割を尊重できるでしょう。【特徴的言語  】容認、尊重、任せる"
						)
					)
		);



?>