<?PHP
	//1 70 以上　2 70以下
	$a_math_advice_sogo_pdf = array(
								"1"=>"ビジネス数学の「５つの力」を日常業務で実践し、客観的で合理的な判断に基づいて業務を遂行することが期待できます。ビジネス数学の学習を通じて身につけた数字の取り扱い方を、ご自分の業務の中に取り入れ、数理的な根拠に基づいたビジネスをこころがけてください。\n\n"
								,"2"=>""
							);
	//以下a,b,cの利用について
	//a 　15以上
	//b   7以上
	//c   0以上
	
	$a_math_advice_haku_pdf = array(
								"a"=>"「把握力」は仕事の上で取り扱うデータやグラフを正しく解釈し、現在の状況を正確につかむ力です。あなたは数値データやグラフで表されたデータ\nを正確につかみとり、何が起こっているかを数理的な根拠をもとに判断できるでしょう。ご自分の仕事の中で扱っている数字についても、その内容や\n意味を正確に把握できるようにこころがけましょう。"
								,"b"=>"「把握力」は仕事の上で取り扱うデータやグラフを正しく解釈し、現在の状況を正確につかむ力です。あなたは表やグラフの数値が意味する内容をつ\nかむ精度がやや低いようです。表やグラフで示されている数値はすべてが必要なものであるとは限りません。仕事上の数字を正しく把握できなければ、\nビジネス上で重大な損失を与えてしまうことにもなりかねないので、まずはご自分の仕事で扱っている数字が、先の業務に活用できるものなのか、そ\nうでないのかを見抜く力を養いましょう。"
								,"c"=>"「把握力」は仕事の上で取り扱うデータやグラフを正しく解釈し、現在の状況を正確につかむ力です。あなたは数字に対する苦手意識から、数字を見\nただけで拒否反応を示す傾向が見られます。どのような仕事でも、多かれ少なかれ必ず数字は取り扱うので、まずは数字に対する苦手意識を克服しま\nしょう。"
							);
	


	$a_math_advice_bunseki_pdf = array(
								"a"=>"「分析力」は集めたデータを分析し、規則性や相関関係を客観的に捉え、次の行動につなげるための情報へと変換する力です。あなたは割合や金利計\n算などを使って、与えられた数値データを目的に合わせた情報に変える基礎的な力が身についているようです。ご自分の仕事の中でもビジネス数学で\n学習した「分析力」の考え方を駆使して、取引先や上司に対して数理的根拠に基づいた有益な提案をしてください。"

								,"b"=>"「分析力」は集めたデータを分析し、規則性や相関関係を客観的に捉え、次の行動につなげるための情報へと変換する力です。あなたは、割合の活用\nや単利と複利の違いなど、ビジネスを進める上で必要な計算がやや苦手なようです。「売上」・「単価」などのビジネス用語の意味をもう一度確認し、\nご自分の仕事の中で数理的な考え方が活用できないかを、常に意識して日々の業務にあたってください。"

								,"c"=>"「分析力」は集めたデータを分析し、規則性や相関関係を客観的に捉え、次の行動につなげるための情報へと変換する力です。あなたは数値データの\n取り扱いに慣れていないようです。ビジネス数学で使うのは、たし算・ひき算・かけ算・わり算などの基本的な計算が中心です。まずは、データ分析\nの基本である割合の計算を克服し、日々の業務で扱う数字に少しずつ慣れましょう。"
							);


	
	$a_math_advice_sentaku_pdf = array(
								"a"=>"「選択力」は数理的な根拠をもとに最適な選択をする力で、ビジネス上のさまざまな判断を下す場面で必要とされる力です。あなたはいくつかの選択\n肢からどれを選ぶのかを決断をしなければならない場面で、数字の裏づけをもって説得力のある選択を行うことができるでしょう。ご自分の業務の中\nでも勘や経験だけで判断せずに、ビジネス数学で学んだ数理的な選択手法の活用を考えてください。"

								,"b"=>"「選択力」は数理的な根拠をもとに最適な選択をする力で、ビジネス上のさまざまな判断を下す場面で必要とされる力です。あなたはデータを合理的\nに加工して比較することがやや苦手なようです。割合を活用して比較検討する方法や、スコアに重み付けをして比較検討する方法など、選択力につな\nがる手法をもう一度見直し、数理的根拠に基づいた合理的な判断を行うようにこころがけてください。"

								,"c"=>"「選択力」は数理的な根拠をもとに最適な選択をする力で、ビジネス上のさまざまな判断を下す場面で必要とされる力です。あなたはいくつかの選択\n肢からどれかを選ぶ場面で、「なんとなく…」で選んでしまう傾向があるようです。選択肢を定量的に比較する手法にはさまざまなものがありますが、\nまずは「単位あたりの量による比較」や「重み付け計算」といった基本的な手法をマスターし、数理的な裏づけのある選択を行うことを意識しましょ\nう。"
							);
	
	$a_math_advice_yosoku_pdf = array(
								"a"=>"「予測力」は過去のデータや現在の状況をもとに、先を見越して計画を立てたり、事業の将来がどのようになるのかを見抜く力です。あなたは移動平\n均や工程表を使って将来の売上や業務の進捗を予測しながら仕事ができるでしょう。ご自分の業務の中でもビジネス数学で学んだ手法を使って、将来\n予測を立てながら業務を進めてください。"

								,"b"=>"「予測力」は過去のデータや現在の状況をもとに、先を見越して計画を立てたり、事業の将来がどのようになるのかを見抜く力です。あなたは、デー\nタをもとに将来を予測しながら業務を遂行する習慣が、十分に身についていないようです。予測はあくまでも予測なのでそのとおりになるとは限りま\nせんが、先をある程度見越して仕事を進めるほうが、トラブルが生じたときにも対処がしやすくなります。まずは移動平均や工程表の活用など、基本\n的な予測ツールの活用を考えてください。"
								,"c"=>"「予測力」は過去のデータや現在の状況をもとに、先を見越して計画を立てたり、事業の将来がどのようになるのかを見抜く力です。あなたはデータ\nを活用して、先を見越した仕事をする意識が低いようです。移動平均や工程表の作成など、将来を予測するための基本的なツールを活用し、データか\nら先を見越す習慣をつけ、数字に対する意識を高めてください。"
							);
	
	$a_math_advice_hyogen_pdf = array(
								"a"=>"「表現力」は図表やグラフなどを効果的に使って、数値情報を相手に分かりやすく伝えるための力です。あなたは相手に何を伝えたいのかによって、\n図表、棒グラフ、円グラフなどを的確に使い分け、ビジュアルで分かりやすく情報を伝えることができるでしょう。ご自分の業務においてさまざまな\n報告を上げる際に、ビジネス数学で学んだ図表やグラフを盛り込めないかを考えてください。"
								,"b"=>"「表現力」は図表やグラフなどを効果的に使って、数値情報を相手に分かりやすく伝えるための力です。あなたはグラフを使って表現する場面で、棒\nグラフを使うべきか、円グラフを使うべきかなど、どのグラフを使えば的確に表現できるのかが、あいまいなままになっているようです。それぞれの\nグラフの得意な表現と苦手な表現を理解して、グラフを的確に使い分ける手法を身につけましょう。"
								,"c"=>"「表現力」は図表やグラフなどを効果的に使って、数値情報を相手に分かりやすく伝えるための力です。あなたは数値情報をグラフで表すことに慣れ\nていないようです。まずは数字だけで表現された情報と、図やグラフを効果的に活用された情報を見比べて、図表やグラフによる表現の有効性を確認\nしてください。確認できたらプレゼンテーション資料や報告書などを作成する際に、棒グラフや折れ線グラフを活用して、相手にとって分かりやすい\n資料を作成してください。"
							);


?>