<?PHP

	
	$array_pdf_question = array(
				"dev1"=>array(
						"自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲を\nもって取り組めない可能性があります"
						,"「あなたは、何かしている際に、自分がネガティブ（イライラ、怒り、不安　等）な気持ちを持っていると気づいたことはありますか?」「その際、ネガティブな気持ちに対してどのように対応しましたか。具体的な例を聞かせてください。」"
						,"自分のネガティブな感情を解消するための具体的な行動\nを説明することができれば問題ありません。ただし、解\n消できないような行動を取っている場合や、行動そのも\nのが説明できない場合、ネガティブな感情を感じたこと\nがない場合には、「リスクとなる行動」が起こる可能性\nを否定できません。"
						),
				"dev2"=>array(
						"自分の能力を過信し、周囲の\n助言を受け入れようとしない、逆に、自分を過小評価してチャレンジしようとしない可能性があります"
						,"「あなたが最近、他者からミスや失敗を指摘\nされた経験はありますか?」「具体的な例を\n聞かせてください。また、指摘された際、あ\nなたはどのように感じ、その後、指摘された\nことを日々の行動においてどのように活かし\nましたか。」"
						,"他人の指摘を素直に受け入れている事例があり、その後\n具体的な行動としての例を説明することができれば問題\nありません。ただし、失敗を受け入れていない、もしく\nは、指摘内容を直そうとしていない場合や、失敗を指摘\nされたことがない場合には、「リスクとなる行動」が起\nこる可能性を否定できません。"
						),
				"dev5"=>array(
						"自分ができること以上の目標\nを定めてしまう傾向があり、\n理想と現実とのギャップが生\nじる可能性があります"
						,"「あなたは、これまでに目標を定めて行動したが、達成できなかったことはありますか?」\nある場合：「なぜ達成できなかったのですか?」\nない場合：「目標を定める場合、どのようなことに気を付けて、目標を設定しますか。」"
						,"目標を定めていたとしても、達成可能な目標であれば問\n題ありません。ただし、目標を定める際に能力の１２０\n％出せば達成できる目標ではなく、２００％以上の能力\nが必要な目標を定めていたり、定めようとしている場合\nには、「リスクとなる行動」が起こる可能性を否定でき\nません。"
						),
				"dev8"=>array(
						"周囲の状況に振り回されてし\nまい、自分のやるべきことが\nできず、安定的に仕事ができ\nない可能性があります"
						,"「所属している集団（友人、ゼミ、アルバイ\nト先等）の中で、人間関係（誰と誰が仲が良\nく、誰がリーダーか等）を考えて行動することはありますか?」「その場合、周囲の人間関\n係は、自分の行動に影響していると思います\nか?」"
						,"周囲の人間関係を考慮して行動していた場合であっても、\n自分の行動にそれほど影響がでていない場合は、問題あ\nりません。ただし、周囲の人間関係の影響で、自分の行\n動を制限したり、影響されやすい場合には、「リスクと\nなる行動」が起こる可能性を否定できません。"
						),
				"dev10"=>array(
						"リーダーシップを取ろうと意\n識するあまり、自分本位な行\n動を取ってしまう可能性があ\nります"
						,"「あなたは他者に対し、自分の意見を伝えた\nり、アドバイスを与えた経験はありますか?」\n「その相手からのネガティブな反応があった\n場合、あなたはどのように対応しますか?」"
						,"他者に対してアドバイスをしたり、自分の意見を伝える\n場合、相手の状況や気持ちを確認している場合は問題あ\nりません。ただし、相手がネガティブな場合でも必要以\n上に自分の意見に固執していた事例がある場合は、「リ\nスクとなる行動」が起こる可能性を否定できません。"
						),
			);

?>