<?PHP
	$mms_pdf = array(
				 1=>"経営陣の理解が浅いようです。メンタルヘルス問題経営課題であることを、役員向け勉強会などを通じて伝え、意識を高めてもらいましょう。\n\n\n\n\n"
				,2=>"人事部門の知識レベルがやや低いようです。人事部門は、メンタルヘルス対策を統括する部門です。業務の全体像をとらえ、的確な施策の立案に役立\nてましょう。\n\n\n\n"
				,3=>"従業員への意識づけが不足しているようです。健康づくりは正しい知識から。メンタルヘルス研修や、ストレスチェックテストなどを実施し、教育啓\n発を行いましょう。\n\n\n\n"
				,4=>"産業医の利活用に関する意識がやや低いようです。労働安全衛生法に則った、正しい産業医の配備と、産業医が活動しやすいルールづくりを心がけま\nしょう。\n\n\n\n"
				,5=>"定期健康診断の実施や事後措置の精度を、もう少し上げましょう。事前準備や実施、そして事後措置の手順を標準化し、全事業場で格差の無い運用を\n目指します。\n\n\n\n"
				,6=>"過重労働者に対するケアが不十分のようです。過重労働はメンタル不調の原因のひとつです。適正な労働時間を守り、労働安全衛生法に則った医師面\n接などの仕組みを作りましょう。\n\n\n\n"
				,7=>"従業員のための相談窓口が不足しているようです。早期相談は、メンタル不調を重症化させない有効な手立てです。何もないのは安全配慮義務の観点\nから見ても好ましくありません。外部の専門家活用も視野に入れて検討しましょう。\n\n\n\n"
				,8=>"メンタル不調者の休職～復職に関する一連の流れが、明文化されていないようです。ケースバイケースや属人的な扱いは、労使の紛争を引き起こしか\nねません。明確なルールと、誰もが扱える運用マニュアルを早期に策定しておきましょう。\n\n\n\n"
				,9=>"職場環境の整備が行き届いていないようです。管理監督者によって、業務の分担、周囲の支援、適正な業務量などがコントロールされ、組織的なハラ\nスメント防止ができるよう、仕組みを考えていきましょう。\n\n\n\n"
				,10=>"健康情報は、非常に機微な情報として、慎重に取り扱われなくてはなりません。取扱い者の指定、取り扱いのルールなどを定めて、正しく運用できる\nようにしましょう。\n\n\n\n"
			);

?>