<?PHP
    $comment33_type = array(
        1=>array(
            "title"=>"放任型"
            ,"note"=>"以{培养自主性!!}为目的，促使孩子思考的育儿类型。<br />但是，这个类型有一个问题，就是父母的期待和对孩子的爱是否能让孩子感受到。在和孩子已经建立信赖关系的前提下，那么孩子不但不会感觉缺乏父母的爱，更能成长为具有独立性，不管什么事都能自主判断的人。请仔细观察孩子的行为，以便当他有困难时可以给予建议帮助。"
            ,'imgF'=>"hounin_F"
            ,'imgM'=>"hounin_M"
        ),
        2=>array(
            "title"=>"过度保护型"
            ,"note"=>"不管什么事都帮助孩子做，唯恐照顾不周的育儿类型。以致孩子几乎没有自己独力完成事情的体验，不能培养自立性。并且一旦形成任性撒娇的习惯，可能会变成在家里很威风，在外面却行不通的“不成熟的人”。这个育儿类型的问题是过度的照料和干涉。放心不下孩子的父母，需要认识到这一点，尽量注意可以不用帮助的就不帮助。"
            ,'imgF'=>"kahogo_F"
            ,'imgM'=>"kahogo_M"
        ),
        3=>array(
             "title"=>"专制型"
            ,"note"=>"不考虑孩子的想法，什么事都由父母安排做决定的育儿类型。这样的育儿方式，极可能会使孩子缺乏自主性和个性，不擅长自我表现。 但是如果父母不但是对孩子，对自己也要求严格，那么情况又会不一样。孩子会通过观察父母了解到为什么要严格，从而能接受父母的责备和指责，咬牙努力。"
            ,'imgF'=>"sensei_F"
            ,'imgM'=>"sensei_M"
        ),
        4=>array(
             "title"=>"民主型"
            ,"note"=>"不管什么事都让孩子来判断，引导孩子主动去做的育儿类型。在民主型育儿方式下成长的孩子，很可能会成为在社会中比较优秀的人。<br />但是，育儿随时伴随着感情变化。即使想做民主型的育儿，有时也会出现其他几个育儿类型中的特征。需要养成习惯，经常回顾确认一下自己的育儿类型。"
            ,'imgF'=>"minshu_F"
            ,'imgM'=>"minshu_M"
        )
    );
	
    $comment33_strong = array(
        1=>array(
            "title"=>"自我感情察知能力"
            ,"disp"=>"坦诚对待自己的心情"
            ,"note"=>"你知道有自己的想法和心情是很重要的事。你也知道要做真的自己，就需要平常去了解自己的想法和心情。你能很敏感地感受到自己的心情（高兴，悲伤，不安，等等）。在日常生活中，你很擅长于分析自己做什么事会高兴，并找到想做的事。对别人能坦率地说出自己的感受，能得到真诚的相交。"
            ,'img'=>"dev1"
        ),
        2=>array(
            "title"=>"客观的自我评价能力"
            ,"disp"=>"知道自己的擅长·不擅长"
            ,"note"=>"你知道了解自己的擅长和不擅长是很重要的事。在平常生活中，对自己能做的事，能积极地去对应。对自己不知道的事，能坦率接受周围的建议和帮助。在日常生活中，对于自己一个人不能完成的事，会寻求别人的帮助，会坦率告诉别人自己不擅长的事，向别人学习。会给周围的人留下为人诚实的印象，获得信赖。"
            ,'img'=>"dev2"
        ), 
        3=>array(
            "title"=>"自我肯定能力"
            ,"disp"=>"对自己有自信"
            ,"note"=>"你知道有做事有自信是很重要的。也知道对自己的能力和经验怀有自信，相信自己的未来和成功是很重要的事。这并不是一种自信过度，而是相信｛自己一定可以｝的信心。在日常生活中，遇到沮丧和困难时，也相信自己一定可以克服，从而能去积极对应。"
            ,'img'=>"dev3"
        ), 
        4=>array(
            "title"=>"控制完成能力"
            ,"disp"=>"能控制自己的心情"
            ,"note"=>"你知道控制自己的感情冲动是很重要的事。也知道当感到生气和不安等消极情绪时，如果任凭感情冲动行事，将会不但给周围的人也会给自己带来不好的结果。在日常生活中，即使面临困难和危机，也会对自己说｛静下心来行动｝，从而能平静地做事。"
            ,'img'=>"dev4"
        ), 
        5=>array(
            "title"=>"创造想象能力"
            ,"disp"=>"朝着目标努力去实现"
            ,"note"=>"你知道努力实现自己的既定目标是很重要的事。你了解为了目标经过坚韧不拔的奋斗后取得成功时的成就感，所以能热心地投入工作。在日常生活中，毫不在意妨碍目标的障碍和危险，抱着必胜的心理和凭借强大的行动力，积极进取。"
            ,'img'=>"dev5"
        ), 
        6=>array(
            "title"=>"积极乐观的思考能力"
            ,"disp"=>"对环境变化的适应性强"
            ,"note"=>"你知道在处身于新的环境中时，尽快地适应环境是很重要的事。你认为顺着环境行事是很重要的。并且你认为环境本身是变幻不定的，对这种变化似乎是乐在其中。在日常生活中，看重｛现在｝，并能根据不同的情况因时因势选择进退，看清未来的方向。"
            ,'img'=>"dev6"
        ), 
        7=>array(
            "title"=>"对人的同感能力"
            ,"disp"=>"能够共同感受到对方的心情"
            ,"note"=>"你知道体贴对方的心情是很重要的事。把对方的感受，如同自己的感受一般去理解，就能营造出让对方容易谈话的氛围。在日常生活中，能够做到和他人换位思考，察知他人的情绪，帮助让对方能说出自己的感受，从而使自己能轻松地进入商量的话题。"
            ,'img'=>"dev7"
        ), 
        8=>array(
            "title"=>"情况察知能力"
            ,"disp"=>"能分清所处的氛围"
            ,"note"=>"你知道了解和认清周围的人际关系是很重要的事。你很擅长了解谁和谁关系好，谁和谁关系不好这之类的人际关系，并经常能敏锐地感知人际关系。在日常生活中，因为能感知周围的状况，能够在了解周围的人际关系和其中的潜规则后行动，所以行动时能考虑到对方。"
            ,'img'=>"dev8"
        ), 
        9=>array(
            "title"=>"发挥主动照顾人的能力"
            ,"disp"=>"帮助有困难的人"
            ,"note"=>"你知道去考虑周围的人是否有不满是很重要的事。你能仔细观察周围，敏锐地感觉出是否周围有困难的人。在日常生活中，你能去注意周围的人的感觉。如果有人不满意，会积极行动让人满意。"
            ,'img'=>"dev9"
        ), 
        10=>array(
            "title"=>"发挥领导能力"
            ,"disp"=>"对朋友和周围的人保持积极的影响"
            ,"note"=>"你知道对周围保持影响力的重要性。你有自己的想法，并擅长于去积极地影响周围。集体行动时，经常能发挥恰当的影响力，能带动对方。在日常生活中，在集体里有很强的存在感，在需要做决策时，能抓住主导权做决定。"
            ,'img'=>"dev10"
        ), 
        11=>array(
            "title"=>"表达主张的能力"
            ,"disp"=>"说出自己的想法让别人知道"
            ,"note"=>"你知道既要考虑对方也要告诉对方自己的想法的重要性。即使是很难向对方说出口的情况，也能够做到传达自己的想法而又不伤害对方。因此，也不会有强加自己的想法给对方的做法，在日常生活中，你对对方的意见有不能理解和不满时，能够不犹豫地坦率相问，或是表达自己的想法。"
            ,'img'=>"dev11"
        ), 
        12=>array(
            "title"=>"适应集体的能力"
            ,"disp"=>"和周围的人和谐相处"
            ,"note"=>"你很清楚和周围人的和谐相处以及团队的重要性。你认为和周围的人起冲突和摩擦根本没有好处，所以尽量最小程度争吵。因为知道尊重周围的意见很重要，所以绝不会有对周围的意见置之不理的情况。在日常生活中，会尽量避免有谁会孤立的状况，尽力使所有人都能来参加。"
            ,'img'=>"dev12"
        ), 
        
    );
    
    $comment33_comu = array(
        1=>array(
            "title"=>"平衡型"
            ,"note"=>"能把自己的意见和心情告诉孩子，并能有意识地倾听和理解孩子的意见和心情。<br />积极地参与和孩子的交流。"
        ),
        2=>array(
            "title"=>"接收型"
            ,"note"=>"能有意识地倾听和理解孩子的意见和心情。孩子因为能得到倾听，很有安心感。<br />但另一方面，很少向对方传达自己的意见和心情"
        ),
        3=>array(
            "title"=>"传达型"
            ,"note"=>"能够有意识地积极向孩子传达自己的意见和心情。<br />另一方面，很少去倾听孩子的意见和心情，自己说的多，可能会留意不到孩子的话。"
        ),
        4=>array(
            "title"=>"沉默型"
            ,"note"=>"既很少向孩子传达自己的意见和心情，也很少倾听孩子的意见和心情。<br />可能和孩子的交流本身做的很少。如果孩子已经长大，需要自己独处的时间，那这样也没有问题。但如果不是这样，建立和孩子的亲密关系可能会较难。"
        ),
        
    );
?>