<?PHP

$array_pdf_question = array(
"dev1" => array(
"自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない可能性があります。"
, "「あなたは、何かしている際に、自分がネガティブ（イライラ、怒り、不安　等）な気持ちを持っていると気づいたことはありますか？」「その際、ネガティブな気持ちに対してどのように対応しましたか。具体的な例を聞かせてください。」"
, "自分のネガティブな感情を解消するための具体的な行動を説明することができれば問題ありません。ただし、解消できないような行動を取っている場合や、行動そのものが説明できない場合、ネガティブな感情を感じたことがない場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev2" => array(
"自分の能力を過信し、周囲の助言を受け入れようとしない、逆に、自分を過小評価してチャレンジしようとしない可能性があります"
, "「あなたが最近、他者からミスや失敗を指摘された経験はありますか？」「具体的な例を聞かせてください。また、指摘された際、あなたはどのように感じ、その後、指摘されたことを日々の行動においてどのように活かしましたか。"
, "他人の指摘を素直に受け入れている事例があり、その後具体的な行動としての例を説明することができれば問題ありません。ただし、失敗を受け入れていない、もしくは、指摘内容を直そうとしていない場合や、失敗を指摘されたことがない場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev3" => array(
"自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る可能性があります。"
, "「あなたが一番自信をもてることは何ですか？」「それを実践した具体的な例を聞かせてください。それは、いつ、どのような場面の、どんな行動として発揮しましたか。」"
, "自分の中で自信をもっていることがあり、しかもそれが行動として発揮されている例があれば問題ありません。ただし、まったく自信をもっていることがない、あるいは、自信を持っていてもそれが実践されている行動が無かった場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev4" => array(
"不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう可能性があります。"
, "「あなたは、最近、ネガティブ(イライラ、不満、怒り、不安 等)な気持ちを感じ、感情的な行動を取ってしまった出来事はありましたか？」「その際、その出来事にどのように対応しましたか。具体的な例を聞かせてください。」"
, "自分が感情的になった場合に、冷静な対応した具体的な行動を説明することができれば問題ありません。ただし、冷静とはいえない行動しか取れていない場合や、行動そのものが説明できない場合、感情的になるようなことがない場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev5" => array(
"自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない可能性があります。
"
, "「あなたは、これまでに何か新しいことに挑戦したことはありますか？」ある場合：「どんなことが新しいことだったのですか？」ない場合：「目標を持って物事に取り組んだ経験を話してください。」"
, "新しいことに積極的に挑戦したことがあり、しかもそれが行動として発揮されている例があれば問題ありません。ただし、まったく新しい挑戦をしたことを話せない、あるいは、周囲から言われて行動したような場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev6" => array(
"環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう可能性があります。"
, "「学校（部活・サークル・バイト・仕事）を変わった際、あなたは自分の役割や立場をどのようにして把握しようとしましたか？」「それを実践した具体的な例を聞かせてください。」"
, "新しい状況に応じた適切な対処をしたことがあり、しかもそれが行動として発揮されている例があれば問題ありません。ただし、新しい環境を経験したことをまったく話せない、あるいは、それが実践されている行動が無かった場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev7" => array(
"相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する可能性があります。"
, "「自分と他者の考え方がずれて衝突や対立をしたような経験はありますか？」ある場合：「その衝突や対立をどうやって解決しましたか」ない場合：「他者を気遣い、うまく相手に合わせてあげた経験があれば、その内容を具体的にお話ください。」"
, "ある場合、他者と衝突していても、相手の立場を尊重するような形で解決している事例があれば問題ありません。ない場合でも、他者に配慮した行動であれば問題ありません。ただし、衝突を解決した事例も、他者に配慮した事例も無い場合は、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev8" => array(
"他者の状況や本当の気持ちが読み取れず、周囲から見るとずれた行動を取ってしまう可能性があります。"
, "「相手に話をしていて、相手の微妙な表\情や会話から相手の気持ちの変化を感じた経験はありますか？」「その相手からの反応の意味をどう考え、その後どのような行動を取りましたか？」"
, "相手の反応に応じて適切な対処をしたことがあり、しかもそれが行動として発揮されている例があれば問題ありません。ただし、相手の気持ちの変化を感じたことがない、あるいは、感じたとしても行動できていない場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev9" => array(
"他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする可能性があります"
, "「他者が困っている際、助けた経験はありますか？」「具体的な例を聞かせてください。それは、いつ、どのような場面でどのように行動しましたか。結果はどうなりましたか。」"
, "他者が困っていることに対し、自分から積極的に関わっていく例があれば問題ありません。ただし、他者が困っている際に助けた経験がない、あるいは、周囲が困っていることを気づくことができない場合には、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev10" => array(
"自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない可能性があります。"
, "「あなたは他者に対し、自分の意見を伝えたり、アドバイスを与えた経験はありますか？」「その相手からの反応やその後の行動に変化はありましたか？」"
, "他者に対してアドバイスをしたり、自分の意見を伝えることで周囲に積極的に働きかけている事例が出てくれば問題ありません。ただし、相手に対して、自分の意見を伝えたり、アドバイスした事例も無い場合は、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev11" => array(
"自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない可能性があります。"
, "「自分と他者の考え方がずれて衝突や対立をしたような経験はありますか？」ある場合：「その衝突や対立をどうやって解決しましたか？」ない場合：「他者を気遣い、うまく相手に合わせてあげた経験があれば、その内容を具体的にお話ください。」"
, "「ある場合」に、他者と衝突・対立しても、相手の立場を尊重する形で解決している事例が出てくれば問題ありません。「ない場合」も、他者に配慮した行動をとっていることが確認できれば問題ありません。ただし、衝突を解決したり、他者に配慮した事例が無い場合は、「リスクとなる行動」が起こる可能性を否定できません。"
),
"dev12" => array(
"自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立する可能性があります"
, "「人とのコミュニケーションで失敗してしまったことがありますか？」「具体的な例を聞かせてください。それは、いつ、どのような場面でどのように失敗しましたか。結果はどうなりましたか。」"
, "自分から積極的に相手に関わっていこうとする姿勢が伺える事例が出てくれば問題ありません。また、人の話を聞こうとする姿勢が確認できれば問題ありません。ただし、相手に対し、拒否や防御的な態度が原因で失敗している場合は、「リスクとなる行動」が起こる可能性を否定できません。"
),
"space" => array("　　　　　　　　　　　　　　　　　　　　　　　　"
, "　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"
),
);
?>