<?PHP

$array_pdf_strongPoint = array(
			"dev1"=>"あなたは、自分の気持ちや考え方を持つことの大切さを知っています。また、自分に素直でいるためには、日頃から自分の気持ちや考えを把握することの大切さを知っています。あなたは自分が感じている気持ち（楽しい、悲しい、不安だ　等）に対するアンテナの感度が敏感です。日常生活において、自分が何をすると楽しいかを確認しながら、やりたいことを見つけることが上手です。また、他者に対して自分の気持ちを素直に語ることができ、本音の付き合いができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev2"=>"あなたは、自分の得意なこと、苦手なことを把握することの大切さを知っています。また、日々の生活の中では、自分ができることについては、積極的に取り組み、知らないことについては、周囲の助言や助けを素直にもとめることが大切であることを知っています。日常生活において、あなたの力だけで目的を実現できない場合は、人に助けを求めたり、苦手なことは素直に人に聞いたり、学んだりすることができるでしょう。周囲に誠実な印象や信頼を得ることができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev3"=>"あなたは、自信を持って行動することの大切さを知っています。また、自分の能力や過去に経験してきたことなどに自信を持つことの大切さや、自分の可能性や将来的な成功を信じる大切さを知っています。決して、自信過剰になるということではなく、「自分ならきっとできる」と信じているのです。日常生活において、気落ちしたり、困難なことが起こったとしても、自分には乗り越えられるはずだと信じて、積極的に取り組むことができるでしょう。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev4"=>"あなたは、自分の衝動的な感情をコントロールすることの大切さを知っています。また、自分が怒りや不安などのようなネガティブな気持ちを感じたときに、感情のまま衝動的に行動すると周囲だけでなく、自分にもあまり良い結果にならないことを知っています。日常生活において、困難な状況や危機に直面しても、「落ち着いて行動しよう」と自分に言い聞かせることで、落ち着いた行動ができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev5"=>"あなたは、自分自身で定めた目標を達成することの大切さを知っています。あなたは目標を達成するためには、粘り強くがんばった結果として得られる達成感を知っており、熱意を持って仕事に取り組めます。日常生活において、目標達成に立ちはだかる障害やリスクにも尻込みせず、絶対達成しようという意欲と持ち前の行動力を活かして、物事に取り組むことができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev6"=>"あなたは、新しい環境におかれた場合、素早く適応することの大切さを知っています。あなたは与えられた環境の「流れに沿って進む」ことを大切にします。また、環境とはある程度変わるものだと考えているか、変わることを楽しめているのかもしれません。日常生活において、「今」を大切にし、それぞれの状況で流れに乗りながら、進む方向をひとつずつ選択することにより、将来を見極めていくことができるでしょう。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev7"=>"あなたは、相手の気持ちを思いやることの大切さを知っています。相手が感じていることを、まるで自分自身の気持ちであるかのように感じ、理解することで、相手が話しやすい状況を作り出せること知っています。日常生活において、自分を他人の状況に置き換えて考えることにより、他人の感情を察し、相手が感じていることを表現するのを手助けすることで、相手と話をする場合に相談しやすい状況を作り出すことができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev8"=>"あなたは、あなたの周囲の人間関係を察知したり、認識したりすることの大切さを知っています。誰と誰が仲が良く、仲が良くないか等の人間関係を敏感に察知することが得意で、つねに人間関係を感じ取るアンテナの感度が高い状態です。日常生活において、周囲の状況を感知することで、周囲の人間関係やその中にある暗黙のルールを読み取って行動するため、相手を配慮した行動をとることができるでしょう。  　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev9"=>"あなたは、周囲の人が不満を感じていないかということに配慮することの大切さを知っています。周囲に目を配り、困っていないかについて感じるアンテナの感度が高いでしょう。日常生活において、常に周囲の人がどのように感じているのかについて、注意を払うことができます。満足していない人がいる場合には、その人が満足するように積極的に行動することができるでしょう。  　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev10"=>"あなたは、周囲に対して影響力を持つことの大切さを知っています。自分自身の考えを持ち、積極的に周囲に働きかけることが得意でしょう。グループで行動する場合には、結果的に相手が動かされるような、適切な影響力を発揮していることが多いでしょう。日常生活において、グループの中で強い存在感を発揮し、何かを決定するような場合では主導権を握り、決断を下すことができるでしょう。  　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev11"=>"あなたは、相手に配慮しつつ、自分の考えを相手に伝えることの大切さを知っています。相手には言いにくい状況であっても、相手が気分を害さないように自分の考えを伝えることが得意でしょう。したがって、自分の考えを押し付けたりはしないでしょう。日常生活において、あなたが相手の意見に対して、理解できないことや不満点を持つような状況では、ためらわず率直に質問したり、自分の考えを伝えたりすることができるでしょう。  　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

			,"dev12"=>"あなたは、周囲との調和やチームワークの大切さを知っています。あなたは、周囲との衝突や摩擦から得るものはないという考えを持っているため、そのような争いを最小限にしようとします。周囲の意見を尊重することが大切ということで、決して周囲の意見に流されるということではありません。日常生活においては、誰かが孤立するような状況は避け、全員が参加できるような状況になるように働きかけることができるでしょう。 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"

		);

$array_pdf_strongArea = array(
			"dev1"=>"周囲に自分の気持ちや考えを積極的に伝えましょう。それによって自分の大切なことを把握できますし、周囲の人が、「あなたがどんな人か」、「あなたとどうかかわればよいのか」わかります。"
			,"dev2"=>"自分の「できること」、「できないこと」のリストを作成し、周囲と共有しましょう。そうすることで、あなたに何をお願いすればよいかわかり、円滑に業務を進めることができます。"
			,"dev3"=>"混乱している時こそ、あなたの強みが発揮できます。あなたは冷静に自分の考えを言葉に出し、周囲の人達に共有しましょう。そうすることで、周囲に落ち着きや安心感を与えることができます。"
			,"dev4"=>"何かを完遂しなければならない業務がある時には、まず期限を設定しましょう。その期限に沿ってスケジュールを組み立て、業務を進めることができます。そのことが、あなたをやる気にさせます。"
			,"dev5"=>"「忙しい」と感じることが好きですが、進歩や結果が見えるようにスケジュールや目安を決めましょう。また、目標を達成したら、次は少し高い目標を設定し、自分の意欲を高めましょう。"
			,"dev6"=>"他の人達がリスクをとることを恐れていたり、乗り気になれなかったりしているとき、あなたはそれらを前に進める力になれます。積極的に発言したり、行動し、事態に対応しましょう。"
			,"dev7"=>"同僚、部下、更には上司の相談相手になってみましょう。何かあれば、周囲の人はあなたに相談したいと思うようになるでしょう。人から頼られることはあなたに喜びをもたらすでしょう。"
			,"dev8"=>"あなたが自然と把握できる人間関係が把握できない人がいます。その際は、衝突を避けるため、サポートしてあげましょう。そうすることで、チームのコミュニケーションが円滑になります。"
			,"dev9"=>"周囲の人が辛そうにしていることに気がついたら、その人にさりげなく伝えましょう。あなたのように人が困っている状況に気づける能力を持っている人はあまりいないことを覚えておきましょう。"
			,"dev10"=>"物事が停滞している時には、一歩踏み出し、障害を打破しましょう。その姿勢が、周囲の人達を安心させます。物事を前進させるあなたの思い切りのよさを他の人達は頼りにしています。"
			,"dev11"=>"自分が感じていること、考えたことを意識して周囲に伝えましょう。そうすることで、話が一方通行で終わらず、自分の意見を言ってくれるあなたに、周囲の人が意見を求めにくるようになります。"
			,"dev12"=>"あなたは違いを自然に受け入れることができ、周りの考えや気持ちを受け止め、周囲が合意できる妥協点を見つけることができます。この合意点が、集団が共に頑張るための出発点になります。"
		);

?>