<?PHP

$array_pdf_stress = array(
						"1"=>"【自己感情モニタリング力】が低く、自分の本心に興味がないか、あるいは気付かない傾向を抱える。\n意識の有無に関係なく、本心と異なる言動･行動をとり続けることは、精神面に大きな負荷を与える。また【客観的自己評価力】も\n低く、自身の長所･短所や価値観などを適切に把握できていないと考えられる。上記2点を考え合わせると、例えば、自身の能力以上\nの仕事を引き受けてしまい、それが自分にできるかどうかといった不安感情を無視（もしくは気づかず）し続けていくことで、スト\nレスを抱え込むリスクがある。これが許容範囲を超えた場合、心身症や神経症を発症することもあり、採用リスクは高い。"

						,"2"=>"【自己感情モニタリング力】が極端に低く、自分の本心に興味がないか、あるいは気付かない傾向が強い。\n場合によっては、あえて自分の本心から目をそらしているケースもある。「自分が本当はどうしたいのだろう」と考えて、心の中の\n本当の気持ちと、実際の言動･行動に食い違いがないかを自己監視していくこと（自分なりの判断軸を持つこと）は、日々を活き活き\nと活動する上で重要なことであり、本心と行動の乖離が続くことは、当人の精神にも大きな負荷（ストレス）を与えることになる。\n\n"
						,"3"=>"【客観的自己評価力】が極端に低く、自身の長所･短所や価値観などを客観的に把握できない傾向が強い。\n結果的には、自分を過大評価して自身の能力を上回る仕事を引き受けてしまったり、逆に過小評価して本来こなせる仕事を断ったり\nするなど、いずれのケースでも周囲との軋轢を生ずることとなる。また、自身の弱み･欠点を自覚できないことから、周囲からのアド\nバイスや建設的な批判などを素直に受け止められず、改善すべきことを直せないといったケースも出てくる。\n\n"
						,"4"=>"【自己感情モニタリング力】【客観的自己評価力】ともに40以上なので、自身の本心に関して、また自身の能力に関しても、ほぼ適\n切に把握できている。ストレス･リスクはさほど問題ない。とはいえ、どちらの数字も水準値より下位にあり、将来にわたって過度な\nストレスを受けたりした際の対応などには、一応注意を払うべき。\n\n\n"
						,"5"=>"特に問題ありません。\n\n\n\n\n"
					);
$array_pdf_stress2_1 = array(
						"1"=>"自身の気持ちの変化や心の状態を常に把握できており、実際の言動との食い違いを客観的に見る、あるいは見ようと意識している。\nそして何かに取り組む際にも、自身の進みたい方向や判断軸が明確になっているおかげで、活き活きと活動できる。\n"

						,"2"=>"自身の強さと限界をわきまえており、余裕を持って自身を見つめている。ゆえに得意なことや自信のある領域を強調するばかり\nでなく、逆に苦手なこと、欠点などの自覚はもちろん、周囲からの建設的な批判を素直に受け止め、改善できる柔軟性も併せ持つ。\n"

						,"3"=>"自分自身を価値あるものと認識しており、積極的かつ意欲的に経験を積み重ねていける。自身の能力･知識･経験などに対して自信を\n持っており、連動する形で、自身の可能性や将来的な成功も信じている。自信に裏打ちされた行動は、周囲への影響力も大きい。\n"

						,"4"=>"自制心が強く、自分の感情を抑える術を持つので、平静さを保つことを心がけており、ネガティブな感情をストレートに出すことは\n少ない。同時に克己心を備えるので、不快と感じる状況･環境に対しても、粘り強くがんばり続けるなどの強みを持っている。\n"

						,"5"=>"向上心が高く、自分に対して高い目標や理想を掲げ、達成困難と思われる状況に対しても、意欲的に取り組む傾向が強い。\n自分をより高めるためには、リスクを伴うことにも挑戦して、新境地を切り拓いていくことが、いかに大切かをよく知っている。\n"

						,"6"=>"物事の明るい側面を見出すことがうまい上、ポジティブに対応できる。激しい環境の移り変わりや、どのように立ち向かっていけば\nいいのかわからないような状況･環境に遭遇しても、明るいビジョンを描きつつ、適応していける。\n"

						,"7"=>"常に相手の立場と視点に立って考える態度を保ち、相手の置かれている状況や感情を想像しながら、じっくり話を聞こうと努めて\nいく。職場を始めとした人間関係においては、他者との相互理解を深めあい、円滑な人間関係を構築することに長けている。\n"

						,"8"=>"表情や態度･言葉のニュアンスなどから、周囲のひとたちの様々なことを察知するアンテナの感度が高い。自身が接している組織･集\n団などにおける力関係を把握することに長けている。人間関係や暗黙のルールなどを読み取ることにも関心が強い。\n"

						,"9"=>"他者にあたたかい気持ちで接することを心がけており、対象者がつらい心境や困難な状況にあると、手を差し伸べずにはいられない\n（広義では、ボランティアや寄付行為なども含まれる）。周囲と良好な関係を築き上げることに長けている。\n"

						,"10"=>"集団の目標達成、あるいは集団の維持･強化のために効果的に行動することを重視している。強力な牽引力を発揮しつつ、さらには\n民主的に構成員間の人間関係のトラブルなどを調節することにより、その集団･組織を目指す方向に率いていく資質に富んでいる。\n"

						,"11"=>"相手の立場をおもんばかりつつ、言い方にも配慮を忘れず、それでいながら、自身の考えなどを率直に述べ、また異論や反論を\nはっきり行なうことの重要さを知っている。周囲からは交渉や折衝ごとに有能であると評価･認識される。\n"

						,"12"=>"他者と友好関係を成立させ、それを維持したいという気持ちが強い。常日頃から良好な人間関係を構築･維持することに腐心し、\n自身が高い評価を受けることと同等、あるいはそれ以上に仲間全体として高評価を受けることを重視する。\n"

					);

$array_pdf_stress2_2 = array(
						"1"=>"また、自身の気持ちの変化や心の状態を常に把握できており、実際の言動との食い違いを客観的に見る、あるいは見ようと意識して\nいる。そして何かに取り組む際にも、自身の進みたい方向や判断軸が明確になっているおかげで、活き活きと活動できる。\n　　　　　　"
						,"2"=>"また、自身の強さと限界をわきまえており、余裕を持って自身を見つめている。ゆえに得意なことや自信のある領域を強調するばか\nりでなく、逆に苦手なこと、欠点などの自覚はもちろん、周囲からの建設的な批判を素直に受け止め、改善できる柔軟性も併せ持つ。\n　"
						,"3"=>"また、自分自身を価値あるものと認識しており、積極的かつ意欲的に経験を積み重ねていける。自身の能力･知識･経験などに対して\n自信を持っており、連動する形で、自身の可能性や将来的な成功も信じている。自信に裏打ちされた行動は、周囲への影響力も大き\nい。"
						,"4"=>"また、自制心が強く、自分の感情を抑える術を持つので、平静さを保つことを心がけており、ネガティブな感情をストレートに出す\nことは少ない。同時に克己心を備えるので、不快と感じる状況･環境に対しても、粘り強くがんばり続けるなどの強みを持っている。\n　　"
						,"5"=>"また、向上心が高く、自分に対して高い目標や理想を掲げ、達成困難と思われる状況に対しても、意欲的に取り組む傾向が強い。\n自分をより高めるためには、リスクを伴うことにも挑戦して、新境地を切り拓いていくことが、いかに大切かをよく知っている。\n　　　　"
						,"6"=>"また、物事の明るい側面を見出すことがうまい上、ポジティブに対応できる。激しい環境の移り変わりや、どのように立ち向かって\nいけばいいのかわからないような状況･環境に遭遇しても、明るいビジョンを描きつつ、適応していける。\n　　　　　　　　　　　　　　"
						,"7"=>"また、常に相手の立場と視点に立って考える態度を保ち、相手の置かれている状況や感情を想像しながら、じっくり話を聞こうと\n努めていく。職場を始めとした人間関係においては、他者との相互理解を深めあい、円滑な人間関係を構築することに長けている。\n　　　"
						,"8"=>"また、表情や態度･言葉のニュアンスなどから、周囲のひとたちの様々なことを察知するアンテナの感度が高い。自身が接している\n組織･集団などにおける力関係を把握することに長けている。人間関係や暗黙のルールなどを読み取ることにも関心が強い。\n　　　　　　"
						,"9"=>"また、他者にあたたかい気持ちで接することを心がけており、対象者がつらい心境や困難な状況にあると、手を差し伸べずにはいら\nれない（広義では、ボランティアや寄付行為なども含まれる）。周囲と良好な関係を築き上げることに長けている。\n　　　　　　　　　"
						,"10"=>"また、集団の目標達成、あるいは集団の維持･強化のために効果的に行動することを重視している。強力な牽引力を発揮しつつ、\nさらには民主的に構成員間の人間関係のトラブルなどを調節することにより、その集団･組織を目指す方向に率いていく資質に富ん\nでいる。\n"
						,"11"=>"また、相手の立場をおもんばかりつつ、言い方にも配慮を忘れず、それでいながら、自身の考えなどを率直に述べ、また異論や\n反論をはっきり行なうことの重要さを知っている。周囲からは交渉や折衝ごとに有能であると評価･認識される。\n　　　　　　　　　　　　　"
						,"12"=>"また、他者と友好関係を成立させ、それを維持したいという気持ちが強い。常日頃から良好な人間関係を構築･維持することに腐心\nし、自身が高い評価を受けることと同等、あるいはそれ以上に仲間全体として高評価を受けることを重視する。\n　　　　　　　　　　　"
					);



?>