<?PHP

	$aMessage = array(
						"dev1"=>"あなたは、自分の気持ちや考え方を持つことの大切さを知っています。また、自分に素直でいる\nためには、日頃から自分の気持ちや考えを把握することの大切さを知っています。あなたは自分\nが感じている気持ち（楽しい、悲しい、不安だ　等）に対するアンテナの感度が敏感です。日常\n生活において、自分が何をすると楽しいかを確認しながら、やりたいことを見つけることが上手\nです。また、他者に対して自分の気持ちを素直に語ることができ、本音の付き合いができるでし\nょう。 "
						,"dev2"=>"あなたは、自分の得意なこと、苦手なことを把握することの大切さを知っています。また、日々\nの生活の中では、自分ができることについては、積極的に取り組み、知らないことについては、\n周囲の助言や助けを素直にもとめることが大切であることを知っています。日常生活において、\nあなたの力だけで目的を実現できない場合は、人に助けを求めたり、苦手なことは素直に人に聞\nいたり、学んだりすることができるでしょう。周囲に誠実な印象や信頼を得ることができるでし\nょう。"
						,"dev3"=>"あなたは、自信を持って行動することの大切さを知っています。また、自分の能力や過去に経験\nしてきたことなどに自信を持つことの大切さや、自分の可能性や将来的な成功を信じる大切さを\n知っています。決して、自信過剰になるということではなく、「自分ならきっとできる」と信じ\nているのです。日常生活において、気落ちしたり、困難なことが起こったとしても、自分には乗\nり越えられるはずだと信じて、積極的に取り組むことができるでしょう。 "
						,"dev4"=>"あなたは、自分の衝動的な感情をコントロールすることの大切さを知っています。また、自分\nが怒りや不安などのようなネガティブな気持ちを感じたときに、感情のまま衝動的に行動すると\n周囲だけでなく、自分にもあまり良い結果にならないことを知っています。日常生活において、困難な状況や危機に直面しても、「落ち着いて行動しよう」と自分に言い聞かせることで、落ち\n着いた行動ができるでしょう。 "
						,"dev5"=>"あなたは、自分自身で定めた目標を達成することの大切さを知っています。あなたは目標を達成\nするためには、粘り強くがんばった結果として得られる達成感を知っており、熱意を持って仕事\nに取り組めます。日常生活において、目標達成に立ちはだかる障害やリスクにも尻込みせず、絶\n対達成しようという意欲と持ち前の行動力を活かして、物事に取り組むことができるでしょう。 "
						,"dev6"=>"あなたは、新しい環境におかれた場合、素早く適応することの大切さを知っています。あなたは与えられた環境の「流れに沿って進む」ことを大切にします。また、環境とはある程度変わるものだと考えているか、変わることを楽しめているのかもしれません。日常生活において、「今」を大切にし、それぞれの状況で流れに乗りながら、進む方向をひとつずつ選択することにより、将来を見極めていくことができるでしょう。"
						,"dev7"=>"あなたは、相手の気持ちを思いやることの大切さを知っています。相手が感じていることを、\nまるで自分自身の気持ちであるかのように感じ、理解することで、相手が話しやすい状況を作り\n出せること知っています。日常生活において、自分を他人の状況に置き換えて考えることにより\n、他人の感情を察し、相手が感じていることを表現するのを手助けすることで、相手と話をする\n場合に相談しやすい状況を作り出すことができるでしょう。 "
						,"dev8"=>"あなたは、相手の気持ちを思いやることの大切さを知っています。相手が感じていることを、\nまるで自分自身の気持ちであるかのように感じ、理解することで、相手が話しやすい状況を作り\n出せること知っています。日常生活において、自分を他人の状況に置き換えて考えることにより\n、他人の感情を察し、相手が感じていることを表現するのを手助けすることで、相手と話をする\n場合に相談しやすい状況を作り出すことができるでしょう。 "
						,"dev9"=>"あなたは、周囲の人が不満を感じていないかということに配慮することの大切さを知っています\n。周囲に目を配り、困っていないかについて感じるアンテナの感度が高いでしょう。日常生活に\nおいて、常に周囲の人がどのように感じているのかについて、注意を払うことができます。満足\nしていない人がいる場合には、その人が満足するように積極的に行動することができるでしょ\nう。"
						,"dev10"=>"あなたは、周囲に対して影響力を持つことの大切さを知っています。自分自身の考えを持ち、積\n極的に周囲に働きかけることが得意でしょう。グループで行動する場合には、結果的に相手が動\nかされるような、適切な影響力を発揮していることが多いでしょう。日常生活において、グル\nープの中で強い存在感を発揮し、何かを決定するような場合では主導権を握り、決断を下すこと\nができるでしょう。 "
						,"dev11"=>"あなたは、相手に配慮しつつ、自分の考えを相手に伝えることの大切さを知っています。相手に\nは言いにくい状況であっても、相手が気分を害さないように自分の考えを伝えることが得意でし\nょう。したがって、自分の考えを押し付けたりはしないでしょう。日常生活において、あなたが\n相手の意見に対して、理解できないことや不満点を持つような状況では、ためらわず率直に質問\nしたり、自分の考えを伝えたりすることができるでしょう。 "
						,"dev12"=>"あなたは、周囲との調和やチームワークの大切さを知っています。あなたは、周囲との衝突や摩\n擦から得るものはないという考えを持っているため、そのような争いを最小限にしようとします\n。周囲の意見を尊重することが大切ということで、決して周囲の意見に流されるということでは\nありません。日常生活においては、誰かが孤立するような状況は避け、全員が参加できるような\n状況になるように働きかけることができるでしょう。"
				);
	
	
	$aWork = array(
					"dev1"=>"あなたが何かする際に、自分がネガティブ（イライラ、怒り、不安等）な気持\nちを持っていると気づいたことはありますか？具体的な例を書いてください。\nそれは、いつ、どのような場面でしたか。"
					,"dev2"=>"最近、あなたは、他者からミスや失敗を指摘された経験はありますか？具体的\nな例を書いてください。また、指摘された際のあなたの気持ちも書いてくださ\nい。"
					,"dev3"=>"あなたが一番自信をもてることは何ですか？それを実践した具体的な例を書い\nてください。それは、いつ、どのような場面でしたか。"
					,"dev4"=>"あなたは、最近、ネガティブ（イライラ、不安等）な気持ちを感じた際、感情\n的にならず冷静に行動できた出来事はありましたか？具体的な例を書いてくだ\nさい。それは、いつ、どのような場面でしたか。"
					,"dev5"=>"あなたは、これまでに何か新しいことに挑戦したことはありますか？具体的\nな例を書いてください。それは、いつ、どのような場面でしたか。"
					,"dev6"=>"環境（サークル・バイト・仕事）が変わった際、あなたは自分の役割や立場を\nどのようにして把握しようとしましたか？把握しようと実践した具体的な例を\n書いてください。それは、いつ、どのような場面でしたか。"
					,"dev7"=>"あなたは、自分と他者の考え方がずれて衝突や対立をしたような経験はありま\nすか？具体的な例を書いてください。それは、いつ、どのような場面でした\nか。"
					,"dev8"=>"あなたは、相手に話をしていて、相手の微妙な表情や会話から相手の気持ち\nの変化を感じた経験はありますか？具体的な例を書いてください。\nそれは、いつ、どのような場面でしたか。"
					,"dev9"=>"あなたは他者が困っている際、助けた経験はありますか？具体的な例を書いて\nください。それは、いつ、どのような場面でしたか。"
					,"dev10"=>"あなたは他者に対し、自分の意見を伝えたり、アドバイスを与えた経験はあり\nますか？具体的な例を書いてください。それは、いつ、どのような場面でし\nたか。"
					,"dev11"=>"自分と他者の考え方がずれて衝突や対立をしたような経験はありますか？\n具体的な例を書いてください。それは、いつ、どのような場面でしたか。"
					,"dev12"=>"周囲が上手くコミュニケーションが取れていない中で、あなたが入ることで\n上手くいった経験はありますか？具体的な例を書いてください。それは、\nいつ、どのような場面でしたか。"
				);
	
	$aMessage2 = array(
					"jikoninti"=>"あなたは、４つの領域の中で、特に「自己認知力」を重視する傾向にあります。自分自身の考えや能力を客観的に\n把握したり、他者に指示されてというよりは、自分自身が納得してから、行動を取ることを好む傾向にあります。"
					,"jikoantei"=>"あなたは、４つの領域の中で、特に「自己安定力」を重視する傾向にあります。目標に意識を向け、自分の気持ちや\n行動を安定させたり、落ち着いてコツコツと物事に取り組むような行動を好む傾向にあります。"
					,"taijinninti"=>"あなたは、４つの領域の中で、特に「対人認知力」を重視する傾向にあります。相手の考えや気持ちを把握しようと\nしており、また、周囲が困っていないか等の状況の変化を察知しようとする意識が強い傾向にあります。"
					,"taijineikyo"=>"あなたは、４つの領域の中で、特に「対人影響力」を重視する傾向にあります。自分自身の考えを相手に伝えたり、\n組織やチームの仲間と積極的に関わりを持とうと働きかけるような行動を好む傾向にあります。"
				);


?>